{
    "nav": {
        "toggleNavigation": "Toggle navigation",
        "advancedSettings": "Advanced settings",
        "testPage": "Test page",
        "actual": "(current)"
    },
    "container": {
        "description": "Here, you can define some advanced settings or consult informations about the extension.",
        "saveInfo": "Don't forget to click on Confirm to save your settings!",
        "about": "About Page Shadow",
        "update": "Search update",
        "labelLanguage": "Language:",
            "language": {
                "fr": "Français",
                "en": "English"
            },
        "labelList": "List of web page/site to exclude (one element per line):",
        "titleHelp": "It is only possible to block domains (eg www.google.com) or specific URLs (eg https://en.wikipedia.org/wiki/Google). Note that you can exclude a website or a page by right-clicking and choosing what to block in the Page Shadow submenu, or with the extension menu (at the bottom).",
        "help": "Help",
        "customThemeButton": "Setup your custom theme…",
        "backup": "Backup, restoring settings and presets…",
        "keyboardShortcuts": "Manage keyboard shortcuts…",
        "keyboardShortcutsInfos": "Not yet available with your browser. However, the keyboard shortcut Alt+Shift+S allow you to enable or disable globally the extension.",
        "indiceList": "The websites addresses entered below will be ignored by Page Shadow.",
        "whiteList": "Whitelist (ignore all the websites by default)",
        "titleWhiteList": "Check this checkbox if you want to toggle this list to a whitelist. All the websites will be ignored by default, and you will have to deblock them with the right-click, with the extension menu or by entering their addresses below (eg www.google.com). The blocking/deblocking of specific URLs isn't available with this mode. Enable or disable this setting will reset the list.",
        "textareaPlaceholder": "Example:\nwww.google.com\nhttps://en.wikipedia.org/wiki/Google",
        "reset": "Reset settings",
        "validate": "Confirm"
    },
    "modal": {
        "about": {
            "title": "About Page Shadow",
            "description": "Page Shadow is available for Firefox, Chrome, Opera and Microsoft Edge. This extension is designed by Eliastik",
            "readme": "README file",
            "homepage": "Official page",
            "webpage": "Page Shadow web page:",
            "contact": {
                "title": "Contact the developer",
                "email": "By email",
                "github": "Via Github (issues)"
            },
            "version": "Current version:",
            "browser": "Your web browser:",
            "changelogTitle": "Changelog:",
                "changelog": {
                    "26": "<ul><li>Added the ability to set presets (max 5, which can be created from the advanced settings) to restore them later (via the extension menu, advanced settings or the right-click menu);</li><li>Added a keyboard shortcut (Alt+Shift+S) to enable/disable the extension globally;</li><li>Added the Videos and Backgrounds (images) elements in the Invert the colors function, so they can be inverted or not regardless of the entire page and images;</li><li>Added ability to enable or disable background coloring of the images when the function Increase page contrast is enabled;</li><li>Fixed the display of some elements that could be hidden when the function Increase page contrast was enabled (eg in Google News);</li><li>The space taken by the extension menu has been reduced to accommodate the new functions;</li><li>Other minor changes (see the Readme file).</li></ul>",
                    "25": "<ul><li>Better rendering of the tool Increase page contrast + color contrast of the themes corrected;</li><li>Added the ability to enable or disable the extension with one click;</li><li>Added the Enable/disable automatically tool which allows you to automatically enable and/or disable Page Shadow according to the time;</li><li>Added the ability to write a custom CSS for the custom theme;</li><li>Added a function for archiving/restoring the settings of Page Shadow;</li><li>The Invert images colors tool has been renamed to Invert the colors because it now allows you to invert the colors of the images and/or of the entire page indifferently;</li><li>Improved image detection for the Invert the colors tool;</li><li>The icon of the extension changes according to its activation state for the current page (red/green);</li><li>Other minor changes, bug fixes, and performance improvements (see the Readme file).</li></ul>",
                    "24": "<ul><li>Added the ability to inverse the colors of web pages entirely, not just the images;</li><li>Added new options for custom themes: color of visited links and font;</li><li>The themes now have a color for visited links;</li><li>Added the ability to disable the display of the message after selecting the custom theme for the tool Increase page contrast;</li><li>Bug fixes, performance improvements and adjustments (see the Readme file).</li></ul>",
                    "23": "<ul><li>Added the possibility to create a custom theme;</li><li>Improved the Invert images colors tool: background images are now detected, which greatly improves the rendering of the tool;</li><li>Bug fixes and adjustments (see the Readme file).</li></ul>",
                    "22": "<ul><li>Added 5 new themes (10 to 15);</li><li>Bug fixes, major changes in the extension structure and minor adjustments, especially: <ul><li>Optimizations and important changes in the code of the management of the parameters (dynamic detection of the changes in real time);</li><li>Bug fixes for Firefox Android: disabling the extension for a site or page now works, the main settings panel now scrolls correctly;</li><li>Fixed a bug in the tool Decrease page brightness: in some cases, the percentage of brightness decrease could be incorrect, that made the settings panel completely dark;</li></ul></li><li>For the rest of the changes, see the Readme file.</li></ul>",
                    "211": "<ul><li>XML parsing error in Firefox fixed (bug in i18nextXHRBackend) ;</li><li>The settings are now initialised directly after the installation of the extension ;</li><li>Bug fixed with the manifest file for Microsoft Edge (persistent key in background key).</li></ul>",
                    "21": "<ul><li>Improved performance by fixing a bug: the processor could be occupied more than 50% in some special cases ;</li><li>Added the possibility to toggle the list of websites ignored to a whitelist: all the websites are in this case ignored, and need to be unlocked manually ;</li><li>Added the possibility to choose the color temperature used by the Night mode ;</li><li>Bugs fixed and minor adjustments (see the Readme file).</li></ul>",
                    "203": "<ul><li>It is now possible to disable Page Shadow for a particular website or page via the right-click or via the extension menu</li><li>Bug fixes and minor adjustments (see the Readme file).</li></ul>",
                    "202": "<ul><li>The settings can now be applied in real time</li><li>Fixed Page Shadow icon (the shadow is better)</li><li>Bugs fixes (see the README file).</li></ul>",
                    "201": "<ul><li>Microsoft Edge support</li><li>Performance improvements and bugs fixes (see the README file).</li></ul>",
                    "2": "<ul><li>Firefox support</li><li>New graphical theme based on Bootstrap</li><li>Integrated translation engine and added English translation</li><li>Added color themes for the \"Increase contrast\" tool</li><li>Added night mode</li><li>Added a mode to invert the color of the images</li><li>Performance improvements</li><li>Various fixes (bugs, texts)</li></ul>",
                    "121": "<ul><li>Fixed bug in the advanced settings</li><li>Adding informations about the extension in the advanced settings</li></ul>",
                    "12": "<ul><li>Optimisation of the popup layout</li><li>Improved function \"Increase page contrast\". The transparent images are now supported</li><li>Some adjustements</li></ul>",
                    "11": "<ul><li>Improved function \"Increase page contrast\"</li></ul>",
                    "1": "<ul><li>Initial version</li></ul>",
                        "versionNames": {
                            "26": "Version 2.6 (31/10/2018)",
                            "25": "Version 2.5 (29/04/2018)",
                            "24": "Version 2.4 (02/01/2018)",
                            "23": "Version 2.3 (1/12/2017)",
                            "22": "Version 2.2 (25/10/2017)",
                            "211": "Version 2.1.1 (09/09/2017)",
                            "21": "Version 2.1 (04/09/2017)",
                            "203": "Version 2.0.3 (09/07/2017)",
                            "202": "Version 2.0.2 (17/06/2017)",
                            "201": "Version 2.0.1 (09/06/2017)",
                            "2": "Version 2.0 (05/06/2017)",
                            "121": "Version 1.2.1",
                            "12": "Version 1.2",
                            "11": "Version 1.1",
                            "1": "Version 1.0"
                        }
                }
        },
        "readme": {
            "title": "README file",
            "src": "README_EN.txt"
        },
        "customTheme": {
            "title": "Custom theme settings",
            "description": "Here, you can set your custom theme. To change the colors of the theme, click on the colored circles and choose a color.",
            "saveInfo": "To save your settings, close this window and click on the button \"Confirm\" present at the bottom of this page.",
            "background": "Background color:",
            "texts": "Texts color:",
            "links": "Links color:",
            "linksVisited": "Visited links color:",
            "font": "Font:",
            "placeholderFont": "Font name…",
            "fontHelp": "Enter the name of a font installed on your device, it will replace the default font of the web pages. Entering an empty value has no effect and is equivalent to disable this option.",
            "preview": "Preview:",
            "previewText": "A text.",
            "previewLink": "A link.",
            "previewLinkVisited": "A visited link.",
            "collapseCustomCSS": "Custom CSS code…",
            "customCSSHelp": "You can enter a custom CSS code below that will be loaded along with the custom theme.",
            "customCSSHelpExpUsers": "For experienced users only."
        },
        "archive": {
            "title": "Backup, restoring settings and presets",
            "archive": "Backup",
            "restore": "Restore",
            "descriptionArchive": "You can archive your settings by saving an archive file to your device by clicking the button below. So you can restore it later. The archive files are in JSON format.",
            "buttonArchive": "Archive the settings…",
            "archiveError": "An error has occurred. Try again.",
            "firefoxHelp": "On Firefox, because of a problem, the name of the archive file proposed for download may be invalid. Just rename the file by changing the extension to .json so that it can be restored later.",
            "helpArchive": "If the archive file could not be saved, copy and paste the following text into a text editor by saving it in JSON format (extension in .json):",
            "suggestedName": "Suggested filename:",
            "descriptionRestore": "You can restore an archive of your settings by clicking the button below, then choosing the archive file on your device (in JSON format).",
            "warningRestore": "Warning, the restoration of the archive will erase all your current settings!",
            "buttonRestore": "Restore the settings…",
            "restoreError": "An error occurred while restoring the data. Make sure the chosen file is an archive file of Page Shadow settings in JSON format, and try again.",
            "restoreErrorFilesize": "Archive file too big. The maximum supported size of an archive file is 2 Mo.",
            "restoreErrorExtension": "Invalid file. The file must be a JSON file.",
            "restoreErrorArchive": "This file is not an archive of Page Shadow settings. Make sure you have selected the correct file.",
            "restoreSuccess": "Data restoration completed successfully.",
            "preset": "Presets",
            "descriptionPreset": "Here you can create and load presets so you can restore them instantly later. The settings which can be saved in presets correspond to those displayed in the extension menu. 5 preset slots are available.",
            "warningPreset": "Warning, before loading a preset, save your current settings in another slot because they will be overwritten!",
            "loadPreset": "Load a preset",
            "savePreset": "Create a preset",
            "deletePreset": "Delete a preset",
            "loadPresetLabel": "Choose a preset:",
            "presetTitle": "Preset ",
            "presetEmpty": "Empty",
            "presetTitleEmpty": "Untitled",
            "restorePresetError": "An error has occurred",
            "restorePresetEmpty": "Cannot load this preset because it is empty",
            "restorePresetSuccess": "Loading done successfully",
            "savePresetSelect": "Choose a slot:",
            "savePresetTitle": "Preset name (50 characters max):",
            "savePresetSuccess": "Preset created successfully",
            "deletePresetSuccess": "Preset deleted successfully",
            "infoLoadPreset": "Here, you can load a preset.",
            "infoSavePreset": "The preset will be created with the current settings as displayed in the extension menu.",
            "infoDeletePreset": "Warning, the deletion is definitive!"
        },
        "saved": {
            "title": "Information",
            "message": "Settings saved!"
        },
        "reset": {
            "title": "Information",
            "message": "All the settings have been reseted!"
        },
        "resetConfirm": {
            "title": "Confirmation",
            "message": "Are you sure that you want to reset all the settings of the extension?"
        },
        "close": "Close",
        "ok": "OK",
        "yes": "Yes",
        "no": "No",
        "confirm": "Confirm",
        "load": "Load",
        "create": "Create",
        "delete": "Delete"
    }
}
