{
    "nav": {
        "toggleNavigation": "Toggle navigation",
        "advancedSettings": "Advanced settings",
        "testPage": "Test page",
        "actual": "(current)"
    },
    "container": {
        "saveInfo": "Don't forget to click on Save to validate your list!",
        "saveInfo2": "Don't forget to click on Save to save your options!",
        "about": "About Page Shadow",
        "update": "Search update",
        "language": {
            "fr": "Français",
            "en": "English"
        },
        "labelList": "List of webpages/websites to exclude (one item per line):",
        "titleHelp": "Note that you can exclude a website or a webpage by right-clicking and choosing what to block in the Page Shadow submenu, with the extension menu (at the bottom) or by entering their addresses below.",
        "help": "Help",
        "customThemeButton": "Custom themes",
        "backup": "Backups and presets",
        "keyboardShortcutsInfos": "Not yet available with your browser. However, the keyboard shortcut Alt+Shift+S allow you to enable or disable globally the extension.",
        "indiceList": "The entries below will be ignored by Page Shadow.",
        "whiteList": "Whitelist (ignore all the websites by default)",
        "titleWhiteList": "Check this checkbox if you want to toggle this list to a whitelist. All the websites and webpages will be ignored by default, and you will have to deblock them with the right-click, with the extension menu or by entering their addresses below. Enable or disable this setting will comment all the items of your list.",
        "infoListSyntax": "More informations about the syntax of the list:",
        "textareaPlaceholder": "# One item per line…\n# Example:\nwww.google.com\nhttps://www.google.com/maps\n*.google.*\n/(.*).google.(.*)/",
        "reset": "Reset the settings",
        "validate": "Confirm",
        "customTheme": "Custom theme n°{{count}}",
        "filters": "Filters",
        "save": "Save"
    },
    "tabTitles": {
        "general": "General",
        "lists": "Blacklist/whitelist",
        "customThemes": "Custom themes",
        "presets": "Presets",
        "filters": "Filters",
        "archive": "Archive/restore",
        "storage": "Storage",
        "about": "About",
        "advanced": "Advanced options"
    },
    "generalSettings": {
        "labelLanguage": "Language:",
        "darkTheme": "Interface theme:",
        "darkThemeAuto": "Device theme",
        "darkThemeEnabled": "Dark",
        "darkThemeDisabled": "Light",
        "keyboardShortcutsLabel": "Keyboard shortcuts:",
        "keyboardShortcuts": "Manage keyboard shortcuts…",
        "popupTheme": "Popup theme:",
        "popupThemeSwitch": "Switches and icons",
        "popupThemeClassic": "Checkboxes (classic)",
        "popupThemeModern": "Modern (by default)",
        "enableRightClickMenu": "Enable right-click menu:"
    },
    "advancedOptions": {
        "checkbox": "I understand and I want to access to the advanced options",
        "warning": "Please note that these options are intended for experienced users and developers in order to test the extension. Modifying them could compromise the normal operation of the extension. Only modify them if you know what you are doing.",
        "filtersConfig": {
            "performanceModeEnabled": "Performance mode",
            "autoDetectTransparentBackgroundEnabled": "Automatic transparent background detection",
            "enableMutationObserversForSubChilds": "Mutation Observers enabled for sub-childs elements",
            "opacityDetectedAsTransparentThreshold": "Threshold for detecting opacity as transparent background",
            "enableMutationObserverAttributes": "Enable Mutation Observers for element attributes",
            "enableMutationObserverStyle": "Enable Mutation Observers for element style attributes",
            "enableMutationObserverClass": "Enable Mutation Observers for element class attributes",
            "enableShadowRootStyleOverride": "Enable Shadow Roots style override",
            "shadowRootStyleOverrideDelay": "Shadow Roots style override delay",
            "throttleMutationObserverBackgrounds": "Throttle background detection Mutation Observers",
            "delayMutationObserverBackgrounds": "Delay before running background detection Mutation Observers",
            "autoThrottleMutationObserverBackgroundsEnabled": "Automatic throttle of background detection Mutation Observers",
            "autoThrottleMutationObserverBackgroundsTreshold": "Threshold after which to enable automatic throttle of Mutation Observers",
            "throttledMutationObserverTreatedByCall": "Number of elements processed per call to Mutation Observers when throttling is enabled",
            "delayApplyMutationObserversSafeTimer": "Delay before reapplying Page Shadow settings after detection by Mutation Observers",
            "observeBodyChange": "Observe body element state change",
            "observeBodyChangeTimerInterval": "Interval for the observation of body element state change",
            "enableBrightColorDetection": "Enable detection of bright color",
            "brightColorLightnessTresholdMin": "Minimum lightness treshold for bright color detection",
            "brightColorLightnessTresholdMax": "Maximum lightness treshold for bright color detection",
            "throttleBackgroundDetection": "Throttle background detection on page load",
            "throttleBackgroundDetectionElementsTreatedByCall": "Number of elements processed per call while throttling background detection",
            "backgroundDetectionStartDelay": "Delay before applying background detection",
            "useBackgroundDetectionAlreadyProcessedNodes": "Use an already processed elements list for background detection",
            "help": {
                "performanceModeEnabled": "Enable performance optimizations, this disables detection and processing of element backgrounds.",
                "autoDetectTransparentBackgroundEnabled": "Enable detection of transparent backgrounds. Disabling this feature can cause many display issues.",
                "enableMutationObserversForSubChilds": "When Mutation Observers analyze an element, they traverse and analyze the children of that element. Disabling this may improve performance, but cause display issues.",
                "opacityDetectedAsTransparentThreshold": "An element that has an opacity lower than this threshold will be considered as a transparent element.",
                "enableMutationObserverAttributes": "Mutation Observers will be enabled for attribute mutations of all elements.",
                "enableMutationObserverStyle": "Mutation Observers will be enabled for mutations of style attributes of all elements.",
                "enableMutationObserverClass": "Mutation Observers will be enabled for mutations of class attributes of all elements.",
                "enableShadowRootStyleOverride": "Override Shadow Roots default styles.",
                "shadowRootStyleOverrideDelay": "Wait for this delay (ms) before injecting Page Shadow CSS to Shadow Roots elements.",
                "throttleMutationObserverBackgrounds": "Slow down the processing of Mutation Observers, which reduce CPU usage and improves performance.",
                "delayMutationObserverBackgrounds": "Delay (ms) before processing each Mutation Observer.",
                "autoThrottleMutationObserverBackgroundsEnabled": "Enable Mutation Observer throttle only if needed.",
                "autoThrottleMutationObserverBackgroundsTreshold": "If a Mutation Observer processes a number of elements above this threshold at once, the throttle is enabled. Throttle is disabled when the number of elements processed falls below this threshold.",
                "throttledMutationObserverTreatedByCall": "The number of elements processed by one call to Mutation Observers, when throttle is enabled.",
                "delayApplyMutationObserversSafeTimer": "Applies a delay between Mutation Observers detecting a page change and reapplying Page Shadow settings (increase contrast, invert colors, decrease brightness, or blue light reduction filter). Increasing this timeout may fix issues on some websites.",
                "observeBodyChange": "Observes the state change of the body element (deletion then creation of a new body element). Fixes issues with some websites (like Github) or SPA applications (Single Page Application). Disabling this option may improve performance.",
                "observeBodyChangeTimerInterval": "Observing the state change of the body element relies on a timer that runs at a given interval (instead of using Mutation Observers). The interval is in ms.",
                "enableBrightColorDetection": "Detect element with bright color, and if enabled by the user, disable the Increase contrast function for these elements. Disabling this option may improve performance.",
                "brightColorLightnessTresholdMin": "If an element has a lightness value that is above this treshold but lower than the maximum, the element will be detected as bright color element.",
                "brightColorLightnessTresholdMax": "If an element has a lightness value that is lower than this treshold but above the minimum, the element will be detected as bright color element.",
                "throttleBackgroundDetection": "Applies a delay to the detection of backgrounds on page load, which can improve performance on large pages.",
                "throttleBackgroundDetectionElementsTreatedByCall": "Sets the number of elements processed by each loop call when background detection is throttled. A high value can impact performance.",
                "backgroundDetectionStartDelay": "Apply a delay before applying background detection of the elements. By default 0 ms.",
                "useBackgroundDetectionAlreadyProcessedNodes": "Use an already processed elements list for background detection to avoid re-processing elements. May increase performance but may increase memory usage."
            }
        },
        "saved": "Sauvegardé !"
    },
    "modal": {
        "syntax": {
            "title": "Syntax of the list",
            "content": "<ul><li>You can enter domains (for example <strong>www.google.com</strong>). In this case, only this exact domain will be {{excluded}} and not its subdomains.</li><li>You can enter entire URLs (for example <strong>https://www.google.com/maps</strong>). In this case, only this exact address will be {{excluded2}}.</li><li>You can use the wildcard <strong>*</strong> that replaces 0, 1 or more characters : <strong>https://www.google.fr/maps*</strong> will {{bloqued}} all URLs that begin with this occurrence (for example https://www.google.com/maps/blabla but not https://www.google.com/blabla).</li><li>You can use the wildcard <strong>*</strong> many times and where you want. <strong>*.google.*</strong> will {{bloqued}} all Google subdomains and top-level domains (for example google.com, google.fr, www.google.com, …).</li><li>You can also use regular expressions (starting and ending with <strong>/</strong>).<br />Example: <strong>/(.*).google.(.*)/</strong></li><li>You can comment on a line by putting a <strong>#</strong> character at the beginning of this one.</li><li>Any invalid entries will be ignored without warning.</li>",
            "excluded": "excluded",
            "excluded2": "excluded",
            "bloqued": "block",
            "detected": "detected",
            "detected2": "detected",
            "detected3": "detect"
        },
        "about": {
            "title": "About Page Shadow",
            "description": "Page Shadow is available for Firefox, Chrome, Opera and Microsoft Edge. This extension is designed by Eliastik",
            "readme": "README file",
            "homepage": "Official page",
            "webpage": "Page Shadow web page:",
            "contact": {
                "title": "Contact the developer",
                "email": "By email",
                "github": "Via Github (issues)"
            },
            "version": "Current version:",
            "browser": "Your web browser:",
            "changelogTitle": "Changelog",
            "infos": "Informations",
            "changelog": {
                "2101": "<ul><li>Major performance optimization, which limits the flashes that appeared when navigating between pages or changing settings in real time;</li><li>Added \"Preserve element colors\" function (not enabled by default) to \"Increase contrast\" function. This function preserves the colors of the elements, but replaces colors very close to white or dark colors;</li><li>Improved user experience when \"Modern\" popup theme is enabled. This theme is now the default theme for new installations;</li><li>Minor improvements to the Advanced Settings interface: display of an icon on tabs if changes to settings have not been saved, display of a loading indicator when restoring settings archives;</li><li>Add the setting \"Enable right-click menu\" in General settings (enabled by default);</li><li>Bug fixes and technical improvements (see Readme file)</li></ul>",
                "210": "<ul><li>Page Shadow has undergone a redesign of its graphical interface. Many new features are available (see Readme file);</li><li>Separation of \"Night mode\" from \"Decrease page brightness\" function: \"Night mode\" is now a separate function, named \"Blue light reduction filter\";</li><li>Added the \"Attenuate image colors\" function to avoid displaying colors that are too bright;</li><li>It's now possible to automatically archive Page Shadow settings in the Cloud, at a configurable interval (by default, this feature is disabled);</li><li>A warning is now displayed to warn of the importance of making an archive of the extension settings;</li><li>Optimization of downloading and automatic updating of filters: they are updated only if necessary (date of last update of the file on the server). If an update is necessary, a message is displayed at the level of the list of filters;</li><li>Added advanced options for advanced users in Advanced settings;</li><li>Bug fixes and technical improvements (see Readme file)</li></ul>",
                "291": "<ul><li>Improved performance when enabling/disabling Page Shadow and when changing settings;</li><li>Improved performance of the processing of web pages by Page Shadow;</li><li>It's now possible to set a color in RGB or in HSV in the custom themes settings;</li><li>Added an optional list \"Ultra performance mode\";</li><li>Added theme n°16;</li><li>Bug fixes (see Readme file);</li><li>Technical improvements (see Readme file)</li></ul>",
                "29": "<ul><li>Added the ability to create a preset and update a preset with current settings directly in the extension menu;</li><li>Added the \"Selective\" setting for the Invert the colors function: this setting, based on the filters feature, allows you to invert the colors of a small number of elements which may be displayed incorrectly on a dark theme of the Increase page contrast function;</li><li>Improved display of the Increase page contrast function on most websites (see Readme file);</li><li>Presets enabled for a webpage now have a higher priority than those enabled for the whole website;</li><li>Improved Filters feature (advanced settings) (see Readme file);</li><li>When changing custom themes or presets in advanced settings, Page Shadow warns you if changes to settings have not been saved;</li><li>Performance improvement (see Readme file);</li><li>Bugfixes (see Readme file);</li><li>Technical improvements (see Readme file);</li></ul>",
                "28": "<ul><li>Added the Filters feature, accessible in Advanced Settings. Filters allow, based on rules, to improve the display of websites when the following options are enabled: Increase page contrast or Invert colors. This advance significantly improves the display of some websites when Page Shadow is enabled. This feature can also improve the performance of Page Shadow on some websites. These filters are updated daily from Internet sources. The lists provided by default are downloaded from the eliastiksofts.com website (the extension developer's website). It's also possible to define custom rules. You don't have to do anything more on your side to take advantage of the feature, it's operational as soon as the extension is installed/updated. Filters are updated automatically;</li><li>Addition of the possibility of defining a list of sites/pages where to automatically enable a preset: it's possible to define this list using checkboxes available in the extension menu, or by defining a list manually (the syntax is the same as the feature to disable a website/a page, and supports regular expressions and wildcards);</li><li>It's now possible to apply the presets using keyboard shortcuts (to be configured manually);</li><li>The maximum number of storable presets has been increased from 5 to 10;</li><li>It's now possible to see the settings stored in the presets in the Advanced settings;</li><li>A notification is displayed when the extension has been updated;</li><li>Many bug fixes, performance improvements and other minor fixes (see Readme file);</li><li>Technical improvements (see Readme file).</li></ul>",
                "27": "<ul><li>Added the ability to create multiple custom themes instead of just one before;</li><li>Added Cloud backup in Backups and presets in Advanced settings;</li><li>Improved blacklist/whitelist with more blocking options (wildcard *, regular expressions, etc.);</li><li>The whitelist now supports the same options as the blacklist, previously it only accepted domains;</li><li>Bug fixes and texts fixes.</li></ul>",
                "26": "<ul><li>Added the ability to set presets (max 5, which can be created from the advanced settings) to restore them later (via the extension menu, advanced settings or the right-click menu);</li><li>Added a keyboard shortcut (Alt+Shift+S) to enable/disable the extension globally;</li><li>Added the Videos and Backgrounds (images) elements in the Invert the colors function, so they can be inverted or not regardless of the entire page and images;</li><li>Added ability to enable or disable background coloring of the images when the function Increase page contrast is enabled;</li><li>Fixed the display of some elements that could be hidden when the function Increase page contrast was enabled (eg in Google News);</li><li>The space taken by the extension menu has been reduced to accommodate the new functions;</li><li>Other minor changes (see the Readme file).</li></ul>",
                "25": "<ul><li>Better rendering of the tool Increase page contrast + color contrast of the themes corrected;</li><li>Added the ability to enable or disable the extension with one click;</li><li>Added the Enable/disable automatically tool which allows you to automatically enable and/or disable Page Shadow according to the time;</li><li>Added the ability to write a custom CSS for the custom theme;</li><li>Added a function for archiving/restoring the settings of Page Shadow;</li><li>The Invert images colors tool has been renamed to Invert the colors because it now allows you to invert the colors of the images and/or of the entire page indifferently;</li><li>Improved image detection for the Invert the colors tool;</li><li>The icon of the extension changes according to its activation state for the current page (red/green);</li><li>Other minor changes, bug fixes, and performance improvements (see the Readme file).</li></ul>",
                "24": "<ul><li>Added the ability to inverse the colors of web pages entirely, not just the images;</li><li>Added new options for custom themes: color of visited links and font;</li><li>The themes now have a color for visited links;</li><li>Added the ability to disable the display of the message after selecting the custom theme for the tool Increase page contrast;</li><li>Bug fixes, performance improvements and adjustments (see the Readme file).</li></ul>",
                "23": "<ul><li>Added the possibility to create a custom theme;</li><li>Improved the Invert images colors tool: background images are now detected, which greatly improves the rendering of the tool;</li><li>Bug fixes and adjustments (see the Readme file).</li></ul>",
                "22": "<ul><li>Added 5 new themes (10 to 15);</li><li>Bug fixes, major changes in the extension structure and minor adjustments, especially: <ul><li>Optimizations and important changes in the code of the management of the parameters (dynamic detection of the changes in real time);</li><li>Bug fixes for Firefox Android: disabling the extension for a site or page now works, the main settings panel now scrolls correctly;</li><li>Fixed a bug in the tool Decrease page brightness: in some cases, the percentage of brightness decrease could be incorrect, that made the settings panel completely dark;</li></ul></li><li>For the rest of the changes, see the Readme file.</li></ul>",
                "211": "<ul><li>XML parsing error in Firefox fixed (bug in i18nextXHRBackend) ;</li><li>The settings are now initialised directly after the installation of the extension ;</li><li>Bug fixed with the manifest file for Microsoft Edge (persistent key in background key).</li></ul>",
                "21": "<ul><li>Improved performance by fixing a bug: the processor could be occupied more than 50% in some special cases ;</li><li>Added the possibility to toggle the list of websites ignored to a whitelist: all the websites are in this case ignored, and need to be unlocked manually ;</li><li>Added the possibility to choose the color temperature used by the Night mode ;</li><li>Bugs fixed and minor adjustments (see the Readme file).</li></ul>",
                "203": "<ul><li>It is now possible to disable Page Shadow for a particular website or page via the right-click or via the extension menu</li><li>Bug fixes and minor adjustments (see the Readme file).</li></ul>",
                "202": "<ul><li>The settings can now be applied in real time</li><li>Fixed Page Shadow icon (the shadow is better)</li><li>Bugs fixes (see the README file).</li></ul>",
                "201": "<ul><li>Microsoft Edge support</li><li>Performance improvements and bugs fixes (see the README file).</li></ul>",
                "2": "<ul><li>Firefox support</li><li>New graphical theme based on Bootstrap</li><li>Integrated translation engine and added English translation</li><li>Added color themes for the \"Increase contrast\" tool</li><li>Added night mode</li><li>Added a mode to invert the color of the images</li><li>Performance improvements</li><li>Various fixes (bugs, texts)</li></ul>",
                "121": "<ul><li>Fixed bug in the advanced settings</li><li>Adding informations about the extension in the advanced settings</li></ul>",
                "12": "<ul><li>Optimisation of the popup layout</li><li>Improved function \"Increase page contrast\". The transparent images are now supported</li><li>Some adjustements</li></ul>",
                "11": "<ul><li>Improved function \"Increase page contrast\"</li></ul>",
                "1": "<ul><li>Initial version</li></ul>",
                "versionNames": {
                    "2101": "Version 2.10.1 (9/25/2022)",
                    "210": "Version 2.10 (8/18/2022)",
                    "291": "Version 2.9.1 (12/26/2021)",
                    "29": "Version 2.9 (12/12/2021)",
                    "28": "Version 2.8 (10/24/2021)",
                    "27": "Version 2.7 (16/08/2019)",
                    "26": "Version 2.6 (31/10/2018)",
                    "25": "Version 2.5 (29/04/2018)",
                    "24": "Version 2.4 (02/01/2018)",
                    "23": "Version 2.3 (1/12/2017)",
                    "22": "Version 2.2 (25/10/2017)",
                    "211": "Version 2.1.1 (09/09/2017)",
                    "21": "Version 2.1 (04/09/2017)",
                    "203": "Version 2.0.3 (09/07/2017)",
                    "202": "Version 2.0.2 (17/06/2017)",
                    "201": "Version 2.0.1 (09/06/2017)",
                    "2": "Version 2.0 (05/06/2017)",
                    "121": "Version 1.2.1",
                    "12": "Version 1.2",
                    "11": "Version 1.1",
                    "1": "Version 1.0"
                }
            }
        },
        "readme": {
            "title": "README file",
            "src": "README_EN.txt"
        },
        "customTheme": {
            "title": "Custom themes settings",
            "description": "Here, you can setup your custom themes. To change the colors of the theme, click on the colored circles and choose a color.",
            "saveInfo": "To save your settings, click on the button \"Save\" below the theme selector.",
            "slot": "Slot:",
            "save": "Save",
            "saved": "Saved!",
            "cancel": "Cancel",
            "reset": "Reset",
            "background": "Background color:",
            "texts": "Texts color:",
            "links": "Links color:",
            "linksVisited": "Visited links color:",
            "font": "Font:",
            "placeholderFont": "Font name…",
            "fontHelp": "Enter the name of a font installed on your device, it will replace the default font of the web pages. Entering an empty value has no effect and is equivalent to disabling this option.",
            "preview": "Preview:",
            "previewText": "A text.",
            "previewLink": "A link.",
            "previewLinkVisited": "A visited link.",
            "collapseCustomCSS": "Custom CSS stylesheet…",
            "customCSSHelp": "You can write a custom CSS stylesheet below that will be loaded along with the custom theme.",
            "customCSSHelpExpUsers": "For experienced users only.",
            "customCSSHelpSuggestions": "Press Ctrl+Space to display suggestions as you write your stylesheet.",
            "fontNotCompatible": "This setting is not compatible with your web browser.",
            "firefoxLinuxBugFonts": "This setting may not work on your system.",
            "notifyThemeChangedNotSaved": "You haven't saved your changes to the theme. Are you sure that you want to continue? In this case, you will lose your changes.",
            "notifyThemeChangedNotSavedInfo": "You haven't saved the changes made to the theme. Open the Custom themes tab again if you want to save your changes.",
            "chooseTheme": "Theme:"
        },
        "archive": {
            "title": "Backup, restoring settings and presets",
            "archive": "Backup",
            "restore": "Restore",
            "descriptionArchive": "You can archive your settings by saving an archive file to your device by clicking the button below. So you can restore it later. The archive files are in JSON format.",
            "buttonArchive": "Archive the settings…",
            "archiveError": "An error has occurred. Try again.",
            "firefoxHelp": "On Firefox, because of a problem, the name of the archive file proposed for download may be invalid. Just rename the file by changing the extension to .json so that it can be restored later.",
            "helpArchive": "If the archive file couldn't be saved, copy and paste the following text into a text editor by saving it in JSON format (extension in .json):",
            "suggestedName": "Suggested filename:",
            "descriptionRestore": "You can restore an archive of your settings by clicking the button below, then choosing the archive file on your device (in JSON format).",
            "warningRestore": "Warning, the restoration of the archive will replace all your current settings!",
            "buttonRestore": "Restore the settings…",
            "restoreError": "An error occurred while restoring the data. Make sure the chosen file is an archive file of Page Shadow settings in JSON format, and try again.",
            "restoreErrorFilesize": "Archive file too big. The maximum supported size of an archive file is 5 MB.",
            "restoreErrorExtension": "Invalid file. The file must be a JSON file.",
            "restoreErrorArchive": "This file is not an archive of Page Shadow settings. Make sure you have selected the correct file.",
            "restoreSuccess": "Data restoration completed successfully.",
            "preset": "Presets",
            "descriptionPreset": "Here you can create presets so you can restore/load them instantly later. The settings which can be saved in presets correspond to those displayed in the extension menu. 10 preset slots are available.",
            "warningPreset": "Warning, before loading a preset, save your current settings in another slot because they will be overwritten!",
            "descriptionPresetAdvanced": "Presets also allow you to configure different settings for each website/webpage. For example, you can create a preset that includes the setting \"Increase contrast\" and \"Invert colors\" > \"Selective\", another preset with the setting \"Decrease brightness\", etc. You can then apply one of the preset to a website or a webpage instantly in the extension menu, by selecting \"This website\" or \"This page\" opposite to the line \"Auto enable preset for\". You can also configure the list of website/webpage directly when you create your preset.",
            "loadPreset": "Load",
            "savePreset": "Create/edit",
            "deletePreset": "Delete",
            "loadPresetLabel": "Choose a preset:",
            "presetTitle": "Preset ",
            "presetEmpty": "Empty",
            "presetTitleEmpty": "Untitled",
            "restorePresetError": "An error has occurred",
            "restorePresetEmpty": "The preset is empty and cannot be loaded",
            "restorePresetSuccess": "Loading done successfully",
            "savePresetSelect": "Choose a slot:",
            "savePresetTitle": "Preset name (50 characters max):",
            "savePresetSuccess": "Preset created/edited successfully",
            "deletePresetSuccess": "Preset deleted successfully",
            "infoLoadPreset": "Here, you can load a preset.",
            "infoSavePreset": "The preset will be created/edited with the current settings as displayed in the extension menu. If you are editing an existing preset, select the \"Save the new settings\" checkbox to update the saved settings.",
            "infoDeletePreset": "Warning, the deletion is definitive!",
            "cloud": "Cloud backup",
            "descriptionCloudBackup": "Here you can archive all your settings in the Cloud of the provider of your web browser (Google account, Firefox Sync for example). This will allow you to restore all your settings on all browsers connected to the same account as this one. This function depends on your browser. If you are not connected to any account, the archive will be local.",
            "warningCloudBackup": "Warning, when restoring your settings from a Cloud archive, all your current settings will be replaced!",
            "archiveCloudBtn": "Archive the data",
            "restoreCloudBtn": "Restore the data",
            "archiveCloudError": "An error occurred while archiving the data.",
            "archiveCloudErrorQuota": "An error occurred while archiving the data. Your settings exceed the maximum storage quota provided by cloud archiving (see the Storage tab).",
            "restoreCloudError": "An error occurred while restoring the archive.",
            "archiveCloudSuccess": "Archiving of data done successfully.",
            "restoreCloudSuccess": "Data restoration completed successfully.",
            "archiveCloudNotCompatible": "This feature is not compatible with your web browser.",
            "infoCloudLastArchive": "Archive date:",
            "dateCloudLastArchive": "{{date}} at {{hour}} with the device {{device}}",
            "savePresetWebsite": "List of websites/webpages where to automatically enable the preset:",
            "checkSaveNewSettingsPreset": "Save the new settings",
            "infosStorage": "Storage infos",
            "infosLocalStorage": "Local storage used:",
            "infosCloudStorage": "Cloud storage used:",
            "autoBackupCloudLabel": "Automatic Cloud backup:",
            "autoBackupCloud": {
                "0": "Never",
                "3": "Every 3 days",
                "5": "Every 5 days",
                "7": "Every 7 days",
                "14": "Every 14 days",
                "30": "Every month (every 30 days)",
                "60": "Every 2 months (every 60 days)"
            },
            "autoBackupError": "An error occurred during the last automatic Cloud backup.",
            "restoring": "Restoring data…",
            "archivingCloud": "Backing up data…"
        },
        "presets": {
            "pageShadowEnabled": "Increase contrast:",
            "theme": "Theme:",
            "pageLumEnabled": "Decrease brightness:",
            "pourcentageLum": "Percentage of brightness decrease:",
            "nightModeEnabled": "Night mode:",
            "liveSettings": "Realtime application of setting changes:",
            "colorTemp": "Color temperature of the blue light reduction filter:",
            "colorInvert": "Invert colors:",
            "invertPageColors": "Invert colors:",
            "invertImageColors": "Invert images colors:",
            "invertEntirePage": "Invert entire page colors:",
            "invertVideoColors": "Invert videos colors:",
            "invertBgColor": "Invert background images colors:",
            "autoEnable": "Automatic activation according to time:",
            "disableImgBgColor": "Disable background coloring of images:",
            "selectiveInvert": "Selective invert:",
            "blueLightReductionEnabled": "Blue light reduction filter:",
            "percentageBlueLightReduction": "Intensity of the blue light reduction filter:",
            "brightColorPreservation": "Preserve element colors:",
            "attenuateImageColor": "Attenuate image colors:",
            "attenuateColors": "Attenuate colors:",
            "attenuateImgColors": "Attenuate images colors:",
            "attenuateBgColors": "Attenuate backgrounds colors:",
            "attenuateVideoColors": "Attenuate videos colors:",
            "attenuateBrightColors": "Attenuate elements colors:",
            "presetInfosLabel": "Preset details",
            "enabled": "Enabled",
            "disabled": "Disabled",
            "customTheme": "Custom theme {{count}}",
            "themeNumber": "Theme {{count}}",
            "undefined": "(Not defined)",
            "notifyPresetChangedNotSaved": "You haven't saved your changes to the preset. Are you sure that you want to continue? In this case, you will lose your changes.",
            "notifyPresetChangedNotSavedInfo": "You haven't saved the changes made to the preset. Open the Presets > Create/edit tab again if you want to save your changes."
        },
        "saved": {
            "title": "Information",
            "message": "Settings saved!"
        },
        "reset": {
            "title": "Information",
            "message": "All the settings have been reseted!"
        },
        "resetConfirm": {
            "title": "Confirmation",
            "message": "Are you sure that you want to reset all the settings of the extension?"
        },
        "filters": {
            "title": "Filters",
            "infos": "The filters improve Page Shadow compatibility with websites by fixing display issues. These filters are used by the Increase contrast and Invert the colors features. These filters are downloaded from online sources. They are automatically updated, and it's also possible to do this manually. You can also write your own filter rules.",
            "updateAll": "Update all",
            "addFilter": "Add a new filter source",
            "lastUpdate": "Last update: {{date}} at {{hour}}",
            "lastUpdateNever": "Last update: never",
            "errorUpdate": "Error during the last update",
            "filterDetails": "Filter details",
            "cleanAll": "Clean all cache",
            "addFilterTitle": "Add a filter source",
            "addFilterInfos": "Enter below the address to the filter source:",
            "addFilterAddress": "Filter address:",
            "addFilterErrorEmpty": "You didn't enter anything.",
            "addFilterErrorFetch": "Error connecting to the entered address.",
            "addFilterErrorParsing": "Error retrieving data from the filter. Make sure it's a Page Shadow filter.",
            "addFilterErrorAlreadyAdded": "This filter has already been added.",
            "addFilterErrorUnknown": "An unknown error has occurred.",
            "seeDetails": "See filter details",
            "homepage": "Source homepage",
            "deleteSource": "Delete this source",
            "updateFilter": "Update this filter",
            "editFilter": "Edit your filter",
            "enableFilterAutoUpdate": "Enable auto update",
            "editFilterTitle": "Filter edit",
            "save": "Save",
            "cancel": "Cancel modifications",
            "guide": "Syntax guide",
            "saved": "Saved!",
            "filterInfosLabel": "Advanced filter informations",
            "filterName": "Filter name:",
            "filterSource": "Filter source:",
            "filterHome": "Filter homepage:",
            "filterDescription": "Filter description:",
            "filterUpdateInterval": "Automatic update interval:",
            "filterUpdateIntervalDays_one": "{{count}} day",
            "filterUpdateIntervalDays_other": "{{count}} days",
            "filterDescriptionEmpty": "(Empty)",
            "version": "Version:",
            "license": "License:",
            "licenseEmpty": "(Not specified)",
            "rulesCount": "Number of filter rules:",
            "resetDefaultFilters": "Reset default filters",
            "filtersCount_one": "{{count}} total filter rule",
            "filtersCount_other": "{{count}} total filter rules",
            "filtersStorageSize": "{{count}} {{unit}} of storage used",
            "filtersStorageMaxSize": "{{count}} {{unit}} maximum",
            "filtersWithErrorCount_one": "{{count}} filter rule with error",
            "filtersWithErrorCount_other": "{{count}} filter rules with error",
            "seeErrorDetails": "See error details",
            "filterErrorsLabel": "Filter errors",
            "errorType": {
                "no_type": "No filter rule entered",
                "no_filter": "No parameter (CSS selector) entered for the filter",
                "wrong_css_selector": "Incorrect CSS selector",
                "unknown_type": "Unknown filter rule",
                "incorrect_regexp": "The regular expression for the selection of website/webpage is incorrect",
                "empty": "Empty line",
                "unknown": "Unknown error"
            },
            "errorLine": "Error found at line n°{{count}}",
            "errorLineDetails": "Part of the rule with error:",
            "errorLineMessage": "Complete error message:",
            "errorCount":  "Number of filter rules with errors:",
            "customFilterEditErrorDetected": "Errors detected in your filter",
            "errorCode": "Error code:",
            "hasUpdate": "An update is available for this filter",
            "hasUpdateAuto": "This update will be done automatically, but you can update manually"
        },
        "close": "Close",
        "ok": "OK",
        "yes": "Yes",
        "no": "No",
        "confirm": "Confirm",
        "load": "Load",
        "create": "Create",
        "delete": "Delete",
        "cancel": "Cancel",
        "closeAndSave": "Close and save",
        "closeWithoutSave": "Close without saving",
        "edit": "Edit"
    },
    "unit": {
        "gigabyte": "GB",
        "megabyte": "MB",
        "kilobyte": "kB",
        "byte": "B"
    }
}
