{
    "nav": {
        "toggleNavigation": "Baculer vers la navigation",
        "advancedSettings": "Paramètres avancés",
        "testPage": "Page de test",
        "actual": "(actuel)"
    },
    "container": {
        "description": "Ici, vous pouvez définir certains paramètres avancés ou consulter les informations sur l'extension.",
        "saveInfo": "N'oubliez pas de cliquer sur Valider pour sauvegarder vos paramètres !",
        "about": "À propos de Page Shadow",
        "update": "Rechercher une mise à jour",
        "labelLanguage": "Langue :",
        "language": {
            "fr": "Français",
            "en": "English"
        },
        "labelList": "Liste des sites/pages à exclure (un élément par ligne) :",
        "titleHelp": "Notez que vous pouvez exclure un site ou une page à l'aide du clic-droit et en choissant quoi bloquer dans le sous-menu Page Shadow, à l'aide du menu de l'extension (tout en bas) ou en entrant leurs adresses ci-dessous.",
        "help": "Aide",
        "customThemeButton": "Thèmes personnalisés",
        "backup": "Archives et pré-réglages",
        "keyboardShortcuts": "Gérer les raccourcis clavier…",
        "keyboardShortcutsInfos": "Pas encore disponible avec votre navigateur. Cependant, le raccourci clavier Alt+Shift+S permet d'activer ou désactiver globalement l'extension.",
        "indiceList": "Les entrées ci-dessous seront ignorées par Page Shadow.",
        "whiteList": "Liste blanche (ignorer par défaut tous les sites)",
        "titleWhiteList": "Cochez cette case si vous souhaitez basculer cette liste en liste blanche. Tous les sites et les pages seront par défaut exclus, et vous devrez les débloquer à l'aide du clic-droit, à l'aide du menu de l'extension ou en entrant leurs adresses ci-dessous. Activer ou désactiver ce paramètre commentera tous les éléments de votre liste.",
        "infoListSyntax": "Plus d'infos sur la syntaxe de la liste :",
        "textareaPlaceholder": "# Un élément par ligne…\n# Exemple :\nwww.google.fr\nhttps://www.google.fr/maps\n*.google.*\n/(.*).google.(.*)/",
        "reset": "Réinitialiser les paramètres",
        "validate": "Valider",
        "customTheme": "Thème personnalisé n°{{count}}",
        "filters": "Filtres"
    },
    "modal": {
        "syntax": {
            "title": "Syntaxe de la liste",
            "content": "<ul><li>Vous pouvez entrer des domaines (par exemple <strong>www.google.fr</strong>). Dans ce cas, seul ce domaine exact sera {{excluded}} et non pas ses sous-domaines.</li><li>Vous pouvez entrer des adresses URL entières (par exemple <strong>https://www.google.fr/maps</strong>). Dans ce cas, seule cette adresse exacte sera {{excluded2}}.</li><li>Vous pouvez utiliser le caractère joker <strong>*</strong> qui remplace 0, 1 ou plusieurs caractères : <strong>https://www.google.fr/maps*</strong> {{bloqued}} toutes les adresses URL commençant par cette occurence (par exemple https://www.google.fr/maps/blabla mais pas https://www.google.fr/blabla).</li><li>Vous pouvez placer le caractère joker <strong>*</strong> plusieurs fois et où vous le souhaitez. Ainsi, <strong>*.google.*</strong> {{bloqued}} tous les sous-domaines et tous les domaines de premier niveau de Google (par exemple google.fr, google.com, www.google.com, …).</li><li>Vous pouvez aussi utiliser des expressions régulières (commençant et terminant par <strong>/</strong>).<br />Exemple : <strong>/(.*).google.(.*)/</strong></li><li>Vous pouvez commenter une ligne en mettant un <strong>#</strong> au début de celle-ci.</li><li>Toute entrée invalide sera ignorée sans avertissement.</li>",
            "excluded": "exclu",
            "excluded2": "exclue",
            "bloqued": "bloquera",
            "detected": "détecté",
            "detected2": "détectée",
            "detected3": "détectera"
        },
        "about": {
            "title": "À propos de Page Shadow",
            "description": "Page Shadow est disponible sur Firefox, Chrome, Opera et Microsoft Edge. Cette extension est conçue par Eliastik",
            "readme": "Fichier Lisez-moi",
            "homepage": "Page officielle",
            "contact": {
                "title": "Contacter le développeur",
                "email": "Par e-mail",
                "github": "Via Github (issues)"
            },
            "webpage": "Page web de Page Shadow :",
            "version": "Version actuelle :",
            "browser": "Votre navigateur web :",
            "changelogTitle": "Journal des changements :",
            "changelog": {
                "27": "<ul><li>Ajout de la possibilité de créer plusieurs thèmes personnalisés au lieu d'un seul auparavant ;</li><li>Ajout de Archive Cloud dans Archives et pré-réglages des Paramètres avancés ;</li><li>Amélioration de la liste noire/blanche avec plus d'options de blocage (joker *, expressions régulières, etc.) ;</li><li>La liste blanche supporte désormais les mêmes options que la liste noire, auparavant elle acceptait uniquement les domaines ;</li><li>Corrections de bugs et des textes.</li></ul>",
                "26": "<ul><li>Ajout de la possibilité de définir des pré-réglages (5 max, pouvant être créés depuis les paramètres avancés) afin de les restaurer plus tard (via le menu de l'extension, les paramètres avancés ou le menu du clic-droit) ;</li><li>Ajout d'un raccourci clavier (Alt+Shift+S) permettant d'activer/désactiver l'extension globalement ;</li><li>Ajout des éléments Vidéos et Arrière-plans (images) dans la fonction Inverser les couleurs, ils peuvent ainsi être inversés ou non indépendamment de la page entière et des images ;</li><li>Ajout de la possibilité d'activer ou de désactiver la coloration de l'arrière-plan des images lorsque la fonction Augmenter le contraste de la page est activée ;</li><li>Correction de l'affichage de certains éléments qui pouvaient être masqués lorsque la fonction Augmenter le contraste de la page était activée (par exemple Google Actualités) ;</li><li>L'espace pris par le menu de l'extension a été réduit afin d'accueillir les nouvelles fonctions ;</li><li>Autres changements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "25": "<ul><li>Meilleur rendu de l'outil Augmenter le contraste de la page + contraste de couleurs des thèmes corrigé ;</li><li>Ajout de la possibilité d'activer ou de désactiver l'extension en un clic ;</li><li>Ajout de l'outil Activer/désactiver automatiquement qui permet d'activer et/ou de désactiver automatiquement Page Shadow selon l'heure de la journée ;</li><li>Ajout de la possibilité d'écrire une feuille de style CSS personnalisé pour le thème personnalisé ;</li><li>Ajout d'une fonction d'archivage/restauration des paramètres de Page Shadow ;</li><li>L'outil Inverser les couleurs des images a été renommé en Inverser les couleurs car il permet désormais d'inverser les couleurs des images et/ou de la page entière indiféremment ;</li><li>Amélioration de la détection des images pour l'outil Inverser les couleurs ;</li><li>L'icône de l'extension change en fonction de son état d'activation sur la page actuelle (rouge/vert) ;</li><li>Autres changements mineurs, corrections de bugs et améliorations des performances (voir le fichier Lisez-moi).</li></ul>",
                "24": "<ul><li>Ajout de la possibilité d'inverser les couleurs des pages web entièrement, et non pas seulement les images ;</li><li>Ajout de nouvelles options pour les thèmes personnalisés : couleur des liens visités et police de caractères ;</li><li>Les thèmes ont désormais une couleur pour les liens visités ;</li><li>Ajout de la possibilité de désactiver l'affichage du message après avoir selectionné le thème personnalisé pour l'outil Augmenter le contraste de la page ;</li><li>Corrections de bugs, amélioration des performances et ajustements (voir le fichier Lisez-moi).</li></ul>",
                "23": "<ul><li>Ajout de la possibilité de créer un thème personnalisé ;</li><li>Amélioration de l'outil Inverser les couleurs des images : les images d'arrière-plan sont désormais détectées, ce qui améliore grandement le rendu de l'outil ;</li><li>Corrections de bugs et ajustements (voir le fichier Lisez-moi).</li></ul>",
                "22": "<ul><li>Ajout de 5 nouveaux thèmes (10 à 15) ;</li><li>Corrections de bugs, changements importants dans la structure de l'extension et ajustements mineurs, notamment : <ul><li>Optimisations et changements importants dans le code de la gestion des paramètres (détection dynamique des changements en temps réel) ;</li><li>Corrections de bugs pour Firefox pour Android : la désactivation  de l'extension pour un site ou une page fonctionne désormais, le panneau des paramètres principal défile désormais correctement ;</li><li>Correction d'un bug de l'outil Baisser la luminosité de la page : dans certains cas, le pourcentage de baisse de la luminosité pouvait être incorrect, ce rendait le panneau des paramètres entièrement sombre ;</li></ul></li><li>Pour le reste des changements, voir le fichier Lisez-moi.</li></ul>",
                "211": "<ul><li>Erreur de parsing XML avec Firefox corrigé (bug avec i18nextXHRBackend) ;</li><li>Les paramètres sont désormais initialisés dès l'installation de l'extension ;</li><li>Bug corrigé avec le fichier manifeste pour Microsoft Edge (clé persistent dans la clé background).</li></ul>",
                "21": "<ul><li>Amélioration des performances par la correction d'un bug : le processeur pouvait être occupé à plus de 50% dans certains cas particuliers ;</li><li>Ajout de la possibilité de basculer la liste des sites à ignorer en liste blanche : tous les sites sont dans ce cas ignorés, et il faut les débloquer manuellement ;</li><li>Ajout de la possibilité de choisir la température de couleur utilisée par le Mode nuit ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "203": "<ul><li>Il est désormais possible de désactiver Page Shadow pour un site ou une page particulière via le clic-droit ou via le menu de l'extension ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "202": "<ul><li>Les paramètres peuvent désormais être appliqués en temps réel ;</li><li>Correction de l'icône de Page Shadow (l'ombre est de meilleure qualité) ;</li><li>Corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                "201": "<ul><li>Compatibilité Microsoft Edge ;</li><li>Amélioration des performances et corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                "2": "<ul><li>Compatibilité Firefox ;</li><li>Nouveau thème graphique basé sur Bootstrap ;</li><li>Moteur de traduction intégré et ajout d'une traduction en anglais ;</li><li>Ajout de thèmes de couleur pour l'outil \"Augmenter le contraste\" ;</li><li>Ajout d'un mode nuit ;</li><li>Ajout d'un mode permettant d'inverser la couleur des images ;</li><li>Amélioration des performances ;</li><li>Corrections diverses (bugs, textes).</li></ul>",
                "121": "<ul><li>Correction d'un bug dans les paramètres avancés ;</li><li>Ajout d'informations sur l'application dans les paramètres avancés.</li></ul>",
                "12": "<ul><li>Optimisation de la mise en page de la popup ;</li><li>Amélioration de l'outil \"Augmenter le contraste\". Les images transparentes sont désormais prises en charge ;</li><li>Quelques ajustements.</li></ul>",
                "11": "<ul><li>Amélioration de la fonction \"Augmenter le contraste\".</li></ul>",
                "1": "<ul><li>Version initiale.</li></ul>",
                "versionNames": {
                    "27": "Version 2.7 (16/08/2019)",
                    "26": "Version 2.6 (31/10/2018)",
                    "25": "Version 2.5 (29/04/2018)",
                    "24": "Version 2.4 (02/01/2018)",
                    "23": "Version 2.3 (1/12/2017)",
                    "22": "Version 2.2 (25/10/2017)",
                    "211": "Version 2.1.1 (09/09/2017)",
                    "21": "Version 2.1 (04/09/2017)",
                    "203": "Version 2.0.3 (09/07/2017)",
                    "202": "Version 2.0.2 (17/06/2017)",
                    "201": "Version 2.0.1 (09/06/2017)",
                    "2": "Version 2.0 (05/06/2017)",
                    "12": "Version 1.2",
                    "11": "Version 1.1",
                    "1": "Version 1.0"
                }
            }
        },
        "readme": {
            "title": "Fichier Lisez-moi",
            "src": "README_FR.txt"
        },
        "customTheme": {
            "title": "Paramètres des thèmes personnalisés",
            "description": "Ici, vous pouvez paramétrer vos thèmes personnalisés. Pour modifier les couleurs du thème, cliquez sur les cercles colorés et choisissez une couleur.",
            "saveInfo": "Pour sauvegarder vos paramètres, cliquez sur le bouton « Enregistrer » en dessous du sélecteur de thème.",
            "slot": "Slot :",
            "save": "Enregistrer",
            "saved": "Enregistré !",
            "cancel": "Annuler",
            "reset": "Réinitialiser",
            "background": "Couleur de fond :",
            "texts": "Couleur des textes :",
            "links": "Couleur des liens :",
            "linksVisited": "Couleur des liens visités :",
            "font": "Police de caractères :",
            "placeholderFont": "Nom d'une police…",
            "fontHelp": "Entrez le nom d'une police de caractères installée sur votre appareil, elle remplacera la police de caractères par défaut des pages web. Entrer une valeur vide n'a aucun effet et équivaut à désactiver cette option.",
            "preview": "Prévisualisation :",
            "previewText": "Un texte.",
            "previewLink": "Un lien.",
            "previewLinkVisited": "Un lien visité.",
            "collapseCustomCSS": "Code CSS personnalisé…",
            "customCSSHelp": "Vous pouvez entrer ci-dessous un code CSS personnalisé qui sera chargé en même temps que le thème personnalisé.",
            "customCSSHelpExpUsers": "Pour les utilisateurs expérimentés uniquement.",
            "fontNotCompatible": "Ce paramètre est incompatible avec votre navigateur web.",
            "firefoxLinuxBugFonts": "Il est possible que ce paramètre ne soit pas fonctionnel sur votre système."
        },
        "archive": {
            "title": "Archivage, restauration des paramètres et pré-réglages",
            "archive": "Archiver",
            "restore": "Restaurer",
            "descriptionArchive": "Vous pouvez archiver vos paramètres en enregistrant un fichier archive sur votre appareil en cliquant sur le bouton ci-dessous. Ainsi, vous pourrez le restaurer plus tard. Les fichiers archives sont au format JSON.",
            "buttonArchive": "Archiver les paramètres…",
            "archiveError": "Une erreur est survenue. Veuillez réessayer.",
            "firefoxHelp": "Sur Firefox, à cause d'un problème, le nom du fichier archive proposé au téléchargement peut être invalide. Il suffit de renommer le fichier en changeant l'extension en .json pour qu'il puisse être restauré plus tard.",
            "helpArchive": "Si le fichier archive n'a pas pu être enregistré, copiez-collez le texte suivant dans un éditeur de texte en l'enregistrant au format JSON (extension en .json) :",
            "suggestedName": "Nom de fichier suggéré :",
            "descriptionRestore": "Vous pouvez restaurer une archive de vos paramètres en cliquant sur le bouton ci-dessous, puis en choisissant le fichier de l'archive sur votre appareil (au format JSON).",
            "warningRestore": "Attention, la restauration de l'archive remplacera tous vos paramètres actuels !",
            "buttonRestore": "Restaurer les paramètres…",
            "restoreError": "Une erreur est survenue lors de la restauration des données. Assurez-vous que le fichier choisi soit bien un fichier archive de paramètres Page Shadow au format JSON, puis réessayez.",
            "restoreErrorFilesize": "Fichier archive trop lourd. La taille maximale supportée d'un fichier archive est de 5 Mo.",
            "restoreErrorExtension": "Fichier invalide. Le fichier doit être un fichier au format JSON.",
            "restoreErrorArchive": "Ce fichier n'est pas une archive de paramètres Page Shadow. Assurez-vous d'avoir sélectionné le bon fichier.",
            "restoreSuccess": "Restauration des données effectuée avec succès.",
            "preset": "Pré-réglages",
            "descriptionPreset": "Vous pouvez ici créer et charger des pré-réglages pour pouvoir les restaurer instantanément plus tard. Les réglages sauvegardables correspondent à ceux affichés dans le menu de l'extension. 5 slots de pré-réglages sont disponibles.",
            "warningPreset": "Attention, avant de charger un pré-réglage, sauvegardez vos réglages actuels dans un autre slot car ils seront écrasés !",
            "loadPreset": "Charger un pré-réglage",
            "savePreset": "Créer/modifier un pré-réglage",
            "deletePreset": "Supprimer un pré-réglage",
            "loadPresetLabel": "Choisissez un pré-réglage :",
            "presetTitle": "Pré-régl. ",
            "presetEmpty": "Vide",
            "presetTitleEmpty": "Sans titre",
            "restorePresetError": "Une erreur est survenue",
            "restorePresetEmpty": "Impossible de charger ce pré-réglage car il est vide",
            "restorePresetSuccess": "Chargement effectué avec succès",
            "savePresetSelect": "Choisissez un slot :",
            "savePresetTitle": "Nom du pré-réglage (50 carac. max) :",
            "savePresetSuccess": "Pré-réglage créé/modifié avec succès",
            "deletePresetSuccess": "Pré-réglage supprimé avec succès",
            "infoLoadPreset": "Ici, vous pouvez charger un pré-réglage.",
            "infoSavePreset": "Le pré-réglage sera créé/modifié avec les réglages actuels tels qu'affichés dans le menu de l'extension. Si vous modifiez un réglage existant, cochez la case « Sauvegarder les nouveaux réglages » pour mettre à jour les réglages sauvegardés.",
            "infoDeletePreset": "Attention, la suppression est définitive !",
            "cloud": "Archive Cloud",
            "descriptionCloudBackup": "Vous pouvez ici faire une archive de tous vos paramètres dans le Cloud du fournisseur de votre navigateur web (compte Google, Firefox Sync par exemple). Cela vous permettra de récupérer tous vos paramètres sur tous les navigateurs connectés au même compte que celui-ci. Cette fonction dépend de votre navigateur. Si vous n'êtes connecté à aucun compte, l'archive se fera en local.",
            "warningCloudBackup": "Attention en restaurant vos paramètres à partir d'une archive Cloud, tous vos paramètres actuels seront remplacés !",
            "archiveCloudBtn": "Archiver les données",
            "restoreCloudBtn": "Restaurer les données",
            "archiveCloudError": "Une erreur est survenue lors de l'archivage des données.",
            "restoreCloudError": "Une erreur est survenue lors de la restauration de l'archive.",
            "archiveCloudSuccess": "Archivage des données effectué avec succès.",
            "restoreCloudSuccess": "Restauration des données effectuée avec succès.",
            "archiveCloudNotCompatible": "Cette fonction n'est pas compatible avec votre navigateur web.",
            "infoCloudLastArchive": "Date de l'archive :",
            "dateCloudLastArchive": "le {{date}} à {{hour}} avec l'appareil {{device}}",
            "savePresetWebsite": "Liste des sites/pages où activer automatiquement le pré-réglage :",
            "checkSaveNewSettingsPreset": "Sauvegarder les nouveaux réglages"
        },
        "presets": {
            "pageShadowEnabled": "Augmenter le contraste :",
            "theme": "Thème :",
            "pageLumEnabled": "Baisser la luminosité :",
            "pourcentageLum": "Pourcentage de baisse de la luminosité :",
            "nightModeEnabled": "Mode nuit :",
            "liveSettings": "Application en temps réel des modifications des paramètres :",
            "colorTemp": "Température de couleur du mode nuit :",
            "colorInvert": "Inverser les couleurs :",
            "invertPageColors": "Inverser les couleurs :",
            "invertImageColors": "Inverser les couleurs des images :",
            "invertEntirePage": "Inverser les couleurs de la page entière :",
            "invertVideoColors": "Inverser les couleurs des vidéos :",
            "invertBgColor": "Inverser les couleurs des images d'arrière-plan :",
            "autoEnable": "Activation automatique selon l'heure :",
            "disableImgBgColor": "Désactiver la coloration de l'arrière-plan des images :",
            "presetInfosLabel": "Détails du pré-réglage",
            "enabled": "Activé",
            "disabled": "Désactivé",
            "customTheme": "Thème personnalisé n°{{count}}",
            "themeNumber": "Thème n°{{count}}"
        },
        "saved": {
            "title": "Information",
            "message": "Paramètres sauvegardés !"
        },
        "reset": {
            "title": "Information",
            "message": "Tous les paramètres ont été réinitialisés !"
        },
        "resetConfirm": {
            "title": "Confirmation",
            "message": "Êtes-vous sûr de vouloir réinitialiser tous les paramètres de l'extension ?"
        },
        "filters": {
            "title": "Filtres",
            "infos": "Les filtres permettent d'améliorer la compatibilité de Page Shadow avec les sites web en corrigeant les problèmes d'affichage. Ces filtres sont utilisés par la fonctionnalité Augmenter le contraste de la page et Inverser les couleurs. Ces filtres sont téléchargés depuis des sources en ligne. Ils sont automatiquement mis à jour, et il est également possible de le faire manuellement. Vous pouvez également écrire vos propres règles de filtre.",
            "updateAll": "Tout mettre à jour",
            "addFilter": "Ajouter une source de filtre",
            "lastUpdate": "Dernière mise à jour le : {{date}} à {{hour}}",
            "lastUpdateNever": "Dernière mise à jour le : jamais",
            "errorUpdate": "Erreur lors de la dernière mise à jour",
            "filterDetails": "Détails du filtre",
            "cleanAll": "Vider tous les caches",
            "addFilterTitle": "Ajouter une source de filtre",
            "addFilterInfos": "Entrez ci-dessous l'adresse vers la source de filtre :",
            "addFilterAddress": "Adresse du filtre :",
            "addFilterErrorEmpty": "Vous n'avez rien entré.",
            "addFilterErrorFetch": "Erreur lors de la connexion à l'adresse entrée.",
            "addFilterErrorParsing": "Erreur lors de la récupération des données du filtre. Assurez-vous qu'il s'agisse bien d'un filtre Page Shadow.",
            "addFilterErrorAlreadyAdded": "Ce filtre a déjà été ajouté.",
            "addFilterErrorUnknown": "Une erreur inconnue est survenue.",
            "seeDetails": "Voir les détails du filtre",
            "homepage": "Page d'accueil de la source",
            "deleteSource": "Supprimer cette source",
            "updateFilter": "Mettre à jour le filtre",
            "editFilter": "Éditer votre filtre",
            "enableFilterAutoUpdate": "Activer les mises à jour automatiques",
            "editFilterTitle": "Édition du filtre",
            "save": "Sauvegarder",
            "cancel": "Annuler les modifications",
            "guide": "Guide de la syntaxe",
            "saved": "Sauvegardé !",
            "filterInfosLabel": "Informations avancées du filtre",
            "filterName": "Nom du filtre :",
            "filterSource": "Source du filtre :",
            "filterHome": "Page d'accueil du filtre :",
            "filterDescription": "Description du filtre :",
            "filterUpdateInterval": "Intervalle de mise à jour automatique :",
            "filterUpdateIntervalDays_one": "{{count}} jour",
            "filterUpdateIntervalDays_other": "{{count}} jours",
            "filterDescriptionEmpty": "(Vide)",
            "version": "Version :",
            "license": "Licence :",
            "licenseEmpty": "(Non renseigné)",
            "rulesCount": "Nombre de règles de filtre :",
            "resetDefaultFilters": "Réinstaller les filtres par défaut"
        },
        "close": "Fermer",
        "ok": "OK",
        "yes": "Oui",
        "no": "Non",
        "confirm": "Valider",
        "load": "Charger",
        "create": "Créer",
        "delete": "Supprimer",
        "cancel": "Annuler",
        "closeAndSave": "Fermer et sauvegarder",
        "closeWithoutSave": "Fermer sans sauvegarder",
        "edit": "Éditer"
    }
}
