{
    "nav": {
        "toggleNavigation": "Baculer vers la navigation",
        "advancedSettings": "Paramètres",
        "testPage": "Page de test",
        "actual": "(actuel)"
    },
    "container": {
        "saveInfo": "N'oubliez pas de cliquer sur Sauvegarder pour enregistrer votre liste !",
        "saveInfo2": "N'oubliez pas de cliquer sur Sauvegarder pour enregistrer vos options !",
        "update": "Rechercher une mise à jour",
        "language": {
            "fr": "Français",
            "en": "English"
        },
        "labelList": "Liste des sites/pages à exclure (un élément par ligne) :",
        "titleHelp": "Notez que vous pouvez exclure un site ou une page à l'aide du clic-droit et en choissant quoi bloquer dans le sous-menu Page Shadow, à l'aide du menu de l'extension (tout en bas) ou en entrant leurs adresses ci-dessous.",
        "help": "Aide",
        "keyboardShortcutsInfos": "Pas encore disponible avec votre navigateur. Cependant, le raccourci clavier Alt+Shift+S permet d'activer ou désactiver globalement l'extension.",
        "indiceList": "Les entrées ci-dessous seront ignorées par Page Shadow.",
        "whiteList": "Liste blanche (ignorer par défaut tous les sites)",
        "titleWhiteList": "Cochez cette case si vous souhaitez basculer cette liste en liste blanche. Tous les sites et les pages seront par défaut exclus, et vous devrez les débloquer à l'aide du clic-droit, à l'aide du menu de l'extension ou en entrant leurs adresses ci-dessous. Activer ou désactiver ce paramètre commentera tous les éléments de votre liste.",
        "infoListSyntax": "Plus d'infos sur la syntaxe de la liste :",
        "textareaPlaceholder": "# Un élément par ligne…\n# Exemple :\nwww.google.fr\nhttps://www.google.fr/maps\n*.google.*\n/(.*).google.(.*)/",
        "reset": "Réinitialiser les paramètres",
        "validate": "Valider",
        "customTheme": "Thème personnalisé n°{{count}}",
        "filters": "Filtres",
        "save": "Sauvegarder",
        "autoDisableDarkThemedWebsite": "Désactiver automatiquement Page Shadow sur les pages ou sites ayant un thème sombre",
        "titleAutoDisableDarkThemedWebsite": "Si Page Shadow détecte qu'un site web ou qu'une page web a un thème sombre, l'extension sera désactivée automatiquement pour ce site/page. Cette option ne fonctionne pas si vous avez activé l'option Liste blanche. Ne fonctionne que si les options Augmenter le contraste, Inverser les couleurs et/ou Atténuer les couleurs sont appliquées pour le site ou la page, car le moteur d'analyse n'est pas activé dans les autres cas pour des raisons de performance."
    },
    "tabTitles": {
        "general": "Général",
        "lists": "Liste noire/blanche",
        "customThemes": "Thèmes personnalisés",
        "presets": "Pré-réglages",
        "filters": "Filtres",
        "archive": "Archiver/restaurer",
        "storage": "Stockage",
        "about": "À propos",
        "advanced": "Options avancées"
    },
    "generalSettings": {
        "labelLanguage": "Langue :",
        "darkTheme": "Thème de l'interface :",
        "darkThemeAuto": "Thème de l'appareil",
        "darkThemeEnabled": "Sombre",
        "darkThemeDisabled": "Clair",
        "keyboardShortcutsLabel": "Raccourcis clavier :",
        "keyboardShortcuts": "Gérer les raccourcis clavier…",
        "popupTheme": "Thème de la popup :",
        "popupThemeSwitch": "Switches et icônes",
        "popupThemeClassic": "Cases à cocher (thème classique)",
        "popupThemeModern": "Moderne (par défaut)",
        "popupThemeCompactModern": "Moderne compact",
        "enableRightClickMenu": "Activer le menu du clic droit :"
    },
    "advancedOptions": {
        "checkbox": "J'ai compris et je souhaite accéder aux options avancées",
        "warning": "Attention, ces options sont destinées aux utilisateurs avertis et aux développeurs afin d'effectuer des tests. Les modifier pourrait compromettre le fonctionnement normal de l'extension. Ne les modifiez seulement que si vous savez ce que vous faîtes.",
        "filtersConfig": {
            "debugMode": "Mode de débogage",
            "performanceModeEnabled": "Mode performance",
            "autoDetectTransparentBackgroundEnabled": "Détection automatique des arrière-plans transparents",
            "enableMutationObserversForSubChilds": "Mutation Observers activés pour les sous-enfants",
            "opacityDetectedAsTransparentThreshold": "Seuil de détection de l'opacité en tant qu'arrière-plan transparent",
            "enableMutationObserverAttributes": "Activer les Mutation Observers pour les attributs des éléments",
            "enableMutationObserverStyle": "Activer les Mutation Observers pour l'attribut style des éléments",
            "enableMutationObserverClass": "Activer les Mutation Observers pour l'attribut class des éléments",
            "enableShadowRootStyleOverride": "Activer le remplacement du style des Shadow DOM",
            "shadowRootStyleOverrideDelay": "Délai avant le remplacement du style des Shadow DOM",
            "throttleMutationObserverBackgrounds": "Ralentir les Mutation Observers d'analyse des éléments",
            "delayMutationObserverBackgrounds": "Délai avant l'exécution des Mutation Observers d'analyse des éléments",
            "throttledMutationObserverTreatedByCall": "Nombre d'éléments traités par appel aux Mutation Observers lorsqu'ils sont ralentis",
            "delayApplyMutationObserversSafeTimer": "Délai avant de réappliquer les paramètres de Page Shadow après une détection par Mutation Observers",
            "observeBodyChange": "Observer le changement d'état de l'élément body",
            "observeBodyChangeTimerInterval": "Intervalle d'observation du changement de l'état de l'élément body",
            "observeDocumentChange": "Observer le changement d'état de l'élément document (HTML)",
            "observeDocumentChangeTimerInterval": "Intervalle d'observation du changement de l'état de l'élément document (HTML)",
            "enableBrightColorDetection": "Activer la détection des éléments avec des couleurs vives",
            "brightColorLightnessTresholdMin": "Seuil minimum de détection des éléments avec des couleurs vives (luminosité)",
            "brightColorLightnessTresholdTextMin": "Seuil minimum de détection des éléments textuels avec des couleurs vives (luminosité)",
            "brightColorLightnessTresholdMax": "Seuil maximum de détection des éléments avec des couleurs vives (luminosité)",
            "brightColorSaturationTresholdMin": "Seuil minimum de détection des éléments textuels/dégradés avec des couleurs vives (saturation)",
            "throttleBackgroundDetection": "Ralentir l'analyse des éléments au chargement des pages",
            "throttleBackgroundDetectionElementsTreatedByCall": "Nombre d'éléments traités par appel lors du ralentissement de l'analyse des éléments",
            "backgroundDetectionStartDelay": "Délai avant l'analyse des éléments",
            "useBackgroundDetectionAlreadyProcessedNodes": "Utiliser une liste d'éléments déjà traités pour l'analyse des éléments",
            "enableBrightColorDetectionSubelement": "Traiter les sous-éléments des éléments avec couleurs vives",
            "enableNotMatchingFiltersDetection": "Activer la détection des éléments ne correspondant plus aux filtres",
            "intervalApplyClassChanges": "Intervalle d'application des changements de classes CSS des éléments",
            "delayApplyClassChanges": "Délai avant d'appliquer les changements des classes CSS des éléments",
            "classChangeMaxElementsTreatedByCall": "Nombre d'éléments traités lors du changements des classes CSS",
            "enableDarkImageDetection": "Activer la détection des images/arrières-plan avec couleurs sombres",
            "darkImageDetectionHslTreshold": "Seuil (luminosité, pourcentage) de détection d'un pixel d'image comme étant sombre",
            "darkImageDetectionMinAlpha": "Valeur de canal alpha (pourcentage) minimum pour l'analyse d'un pixel d'image",
            "darkImageDetectionBlockSize": "Taille (pixels) du bloc d'analyse d'un pixel détecté comme sombre",
            "darkImageDetectionTransparentPixelsRatio": "Ratio (pourcentage) pixel transparent/pixel normal pour détecter une image comme étant sombre",
            "darkImageDetectionDarkPixelsRatio": "Ratio (pourcentage) pixel sombre/pixel normal pour détecter une image comme étant sombre",
            "throttleDarkImageDetection": "Ralentir l'analyse des images",
            "throttleDarkImageDetectionDelay": "Délai avant l'exécution de l'analyse d'images",
            "throttleDarkImageDetectionBatchSize": "Nombre d'images traitées par appel",
            "throttleMutationObserverBackgroundsSubChilds": "Ralentir l'analyse des sous-enfants lors d'une détection d'un élément par Mutation Observer",
            "delayMutationObserverBackgroundsSubchilds": "Délai avant l'exécution de l'analyse des sous-enfants d'un élément",
            "throttledMutationObserverSubchildsTreatedByCall": "Nombre de sous-enfants analysés par appel lorsque l'analyse est ralentie",
            "throttleBackgroundDetectionMaxExecutionTime": "Temps d'exécution maximum d'un appel lorsque l'analyse des éléments est ralentie",
            "throttleDarkImageDetectionMaxExecutionTime": "Temps d'exécution maximum d'un appel lors de l'analyse des images si elle est ralentie",
            "throttledMutationObserverMaxExecutionTime": "Temps d'exécution maximum d'un appel aux Mutation Observers lorsqu'ils sont ralentis",
            "throttledMutationObserverSubchildsMaxExecutionTime": "Temps d'exécution maximum d'un appel lorsque l'analyse des sous-enfants est ralentie",
            "applyClassChangesMaxExecutionTime": "Temps d'exécution maximum lors d'un appel à l'application des classes CSS des éléments",
            "autoThrottleBackgroundDetectionTime": "Temps d'exécution maximum pour activer automatiquement le ralentissement de l'analyse des éléments",
            "enableThrottleApplyClassChanges": "Ralentir l'application des changements de classes CSS aux éléments",
            "enableURLChangeDetection": "Activer la détection du changement d'adresse URL",
            "enablePseudoElementsAnalysis": "Activer l'analyse des pseudo-éléments",
            "enableDarkImageDetectionCache": "Activer la mise en cache des images déjà analysées",
            "darkImageDetectionMaxCacheSize": "Taille du cache (nombre d'éléments) des images déjà analysées",
            "mutationObserverProcessNewestFirst": "Traiter les mutations les plus récentes d'abord",
            "enableSelectiveInvertPreserveColors": "Conserver les couleurs lors de l'inversion sélective",
            "darkThemeDetectionMaxLightness": "Luminosité maximale pour détecter un élément comme sombre",
            "darkThemeDetectionMaxSaturation": "Saturation maximale pour détecter un élément comme sombre",
            "darkThemeDetectionMinLightnessLightElements": "Luminosité minimale pour détecter un élément comme clair",
            "darkThemeDetectionPercentageRatioDarkLightElements": "Ratio éléments sombres / éléments clairs pour détecter qu'un site a un thème sombre",
            "darkImageDetectionEnableFetchUseHref": "Activer la récupération des SVG référencés par les balises HTML use",
            "darkImageDetectionEnableCorsFetch": "Activer la récupération des images provenant d'une origine différente (cross-origin)",
            "darkImageDetectionEnableRedirectionCheck": "Activer la vérification des redirections d'images pour détecter les URL provenant d'une origine différente",
            "help": {
                "debugMode": "Active le mode de débogage qui affiche des informations de débogage dans la console JavaScript sur les pages traitées par Page Shadow, ou sur les pages de l'extension.",
                "performanceModeEnabled": "Active des optimisations de performance, cela désactive l'analyse des éléments des pages web. Cependant, la gestion des filtres reste activée.",
                "autoDetectTransparentBackgroundEnabled": "Active la détection des arrière-plans transparents. Désactiver cette fonctionnalité peut provoquer de nombreux problèmes d'affichage.",
                "enableMutationObserversForSubChilds": "Lorsque les Mutation Observers analysent un élément, ils traversent et analysent les enfants de cet élément. Désactiver cela peut améliorer les performances, mais provoque des problèmes d'affichage.",
                "opacityDetectedAsTransparentThreshold": "Un élément qui a une opacité inférieure à ce seuil sera considéré comme étant un élément transparent.",
                "enableMutationObserverAttributes": "Les Mutation Observers seront activés pour les mutations des attributs de tous les éléments.",
                "enableMutationObserverStyle": "Les Mutation Observers seront activés pour les mutations des attributs style de tous les éléments.",
                "enableMutationObserverClass": "Les Mutation Observers seront activés pour les mutations des attributs class de tous les éléments.",
                "enableShadowRootStyleOverride": "Remplace les styles par défaut des Shadow DOM.",
                "shadowRootStyleOverrideDelay": "Attend ce délai (en ms) avant d'injecter la feuille de style CSS de Page Shadow aux éléments Shadow DOM.",
                "throttleMutationObserverBackgrounds": "Ralenti le traitement des Mutation Observers, ce qui soulage le processeur et améliore les performances.",
                "delayMutationObserverBackgrounds": "Délai (ms) avant le traitement de chaque Mutation Observer.",
                "throttledMutationObserverTreatedByCall": "Le nombre d'éléments traités par un appel aux Mutation Observers, lorsque le ralentissement est activé.",
                "delayApplyMutationObserversSafeTimer": "Applique un délai (en ms) entre la détection d'une modification de la page par Mutation Observer et la réappliquation des paramètres de Page Shadow (augmenter le contraste, inverser les couleurs, baisser la luminosité ou filtre de réduction de la lumière bleue). Augmenter ce délai peut corriger des problèmes sur certains sites.",
                "observeBodyChange": "Observe le changement d'état de l'élément body (suppression puis création d'un nouvel élément body). Corrige des problèmes avec certains sites web (comme Github) ou applications SPA (Single Page Application). Désactiver cette option peut améliorer les performances.",
                "observeBodyChangeTimerInterval": "L'observation du changement d'état de l'élément body s'appuie sur un timer qui s'exécute à un intervalle donné (au lieu d'utiliser les Mutation Observer). L'intervalle est en ms.",
                "observeDocumentChange": "Observe le changement d'état du document (élément HTML), et plus particulièrement de l'attribut style. Corrige des problèmes avec certains sites web qui écrasent la valeur de l'attribut style qui est utilisée pour gérer les variables CSS de Page Shadow. Désactiver cette option peut améliorer les performances.",
                "observeDocumentChangeTimerInterval": "L'observation du changement d'état du document (élément HTML) s'appuie sur un timer qui s'exécute à un intervalle donné (au lieu d'utiliser les Mutation Observer). L'intervalle est en ms.",
                "enableBrightColorDetection": "Détecte les éléments avec des couleurs vives et, si l'option est activée par l'utilisateur, désactive la fonction Augmenter le contraste pour ces éléments. La désactivation de cette option peut améliorer les performances.",
                "brightColorLightnessTresholdMin": "Si un élément a une valeur de luminosité supérieure à ce seuil et inférieure à la valeur maximum, l'élément sera détecté comme élément de couleur vive. La valeur maximale est 1, la valeur minimale est 0 (pourcentage).",
                "brightColorLightnessTresholdTextMin": "Pareil que l'option du dessus, mais ne s'applique que sur les éléments textuels (en remplacement).",
                "brightColorLightnessTresholdMax": "Si un élément a une valeur de luminosité inférieure à ce seuil et supérieure à la valeur minimum, l'élément sera détecté comme élément de couleur vive. La valeur maximale est 1, la valeur minimale est 0 (pourcentage).",
                "brightColorSaturationTresholdMin": "Si un élément textuel ou un dégradé a une valeur de saturation supérieure à ce seuil, ainsi qu'une valeur de luminosité supérieure au seuil ci-dessus, l'élément sera détecté comme élément de couleur vive. La valeur maximale est 1, la valeur minimale est 0 (pourcentage).",
                "throttleBackgroundDetection": "Applique un délai (en ms) à l'analyse des éléments au chargement des pages, ce qui permet d'améliorer les performances sur les grandes pages.",
                "throttleBackgroundDetectionElementsTreatedByCall": "Défini le nombre d'éléments traités par chaque appel de boucle lorsque l'analyse des éléments est ralentie. Une valeur élevée peut impacter les performances.",
                "backgroundDetectionStartDelay": "Applique un délai (en ms) avant d'appliquer l'analyse des éléments. Par défaut 5 ms.",
                "useBackgroundDetectionAlreadyProcessedNodes": "Utilise une liste d'éléments déjà traités pour l'analyse des éléments pour éviter de traiter à nouveau les mêmes éléments. Peut améliorer les performances, mais peut augmenter l'utilisation de la mémoire.",
                "enableBrightColorDetectionSubelement": "Active le traitement des sous-éléments des éléments avec couleurs vives. Désactiver cette option peut potentiellement améliorer les performances, mais des problèmes d'affichage peuvent se produire sur certains sites en utilisant la fonction de préservation des éléments avec couleurs vives.",
                "enableNotMatchingFiltersDetection": "Si un élément ne correspond plus à l'un des filtres qui lui a été appliqué précédemment, le filtre est retiré de l'élément. Activer cette option peut réduire les performances et augmenter la consommation de mémoire, car Page Shadow doit stocker les informations sur les éléments qui correspondaient précédemment à un filtre donné.",
                "intervalApplyClassChanges": "Paramètre l'intervalle (en ms) des changements des classes CSS sur les éléments. Augmenter l'intervalle peut améliorer les performances.",
                "delayApplyClassChanges": "Applique un délai supplémentaire (en ms) avant le changement des classes CSS sur les éléments. Augmenter le délai peut améliorer les performances.",
                "classChangeMaxElementsTreatedByCall": "Nombre d'éléments traités (changement de classes CSS) à chaque intervalle. Augmenter ce nombre peut réduire les performances.",
                "enableDarkImageDetection": "Active la détection des images/arrière-plans transparents comportant un grand nombre de couleurs sombres (comme par exemple les logos), afin d'inverser leurs couleurs si le paramètre Inverser les couleurs > Sélectif est activé par l'utilisateur. Désactiver cette option améliore les performances.",
                "darkImageDetectionHslTreshold": "Si un pixel a une valeur de luminosité inférieure à ce seuil, le pixel sera considéré comme sombre. La valeur maximale est 1, la valeur minimale est 0 (pourcentage).",
                "darkImageDetectionMinAlpha": "La valeur minimale (en pourcentage) du canal alpha nécessaire pour analyser le pixel d'une image. Si la valeur est sous ce seuil, le pixel est ignoré. Par défaut 0.5 (pour 50%).",
                "darkImageDetectionBlockSize": "Lorsqu'un pixel est détecté comme étant sombre selon la valeur de luminosité, son voisinage est analysé à la recherche de pixels transparents. Cette valeur paramètre le nombre de pixels à analyser autour du pixel détecté.",
                "darkImageDetectionTransparentPixelsRatio": "Lors de l'analyse du voisinage du pixel détecté comme étant sombre, paramètre le ratio minimum de pixels transparents nécessaires. Si ce ratio est dépassé, alors l'image est détectée comme étant une image sombre.",
                "darkImageDetectionDarkPixelsRatio": "Lors de l'analyse du voisinage du pixel détecté comme étant sombre, paramètre le ratio minimum de pixels sombres supplémentaires nécessaires (par rapport aux pixels non transparents). Si ce ratio est dépassé, alors l'image est détectée comme étant une image sombre.",
                "throttleDarkImageDetection": "Ralenti l'analyse des images des pages, ce qui soulage le processeur et améliore les performances.",
                "throttleDarkImageDetectionDelay": "Paramètre le délai (en ms) avant d'exécuter l'analyse des images mises en file d'attente. Augmenter ce délai peut améliorer les performances.",
                "throttleDarkImageDetectionBatchSize": "Paramètre le nombre d'images en file d'attente à analyser en une fois.",
                "throttleMutationObserverBackgroundsSubChilds": "Ralenti l'analyse des sous-enfants d'un élément détecté par les mutation observers. Cela soulage le processeur et améliore les performances.",
                "delayMutationObserverBackgroundsSubchilds": "Paramètre le délai (en ms) avant d'exécuter l'analyse des sous-enfants d'un élément. Augmenter ce délai peut améliorer les performances.",
                "throttledMutationObserverSubchildsTreatedByCall": "Paramètre le nombre de sous-enfants en file d'attente à analyser en une fois.",
                "throttleBackgroundDetectionMaxExecutionTime": "Si l'exécution de l'appel dépasse ce temps d'exécution (en ms), l'appel est interrompu pour libérer des ressources. Cela améliore considérablement les performances.",
                "throttleDarkImageDetectionMaxExecutionTime": "Si l'exécution de l'appel dépasse ce temps d'exécution (en ms), l'appel est interrompu pour libérer des ressources. Cela améliore considérablement les performances.",
                "throttledMutationObserverMaxExecutionTime": "Si l'exécution de l'appel dépasse ce temps d'exécution (en ms), l'appel est interrompu pour libérer des ressources. Cela améliore considérablement les performances.",
                "throttledMutationObserverSubchildsMaxExecutionTime": "Si l'exécution de l'appel dépasse ce temps d'exécution (en ms), l'appel est interrompu pour libérer des ressources. Cela améliore considérablement les performances.",
                "applyClassChangesMaxExecutionTime": "Si l'exécution de l'appel dépasse ce temps d'exécution (en ms), l'appel est interrompu pour libérer des ressources. Cela améliore considérablement les performances.",
                "autoThrottleBackgroundDetectionTime": "Si le ralentissement de l'analyse des éléments n'est pas activé, il est activé automatiquement si le temps d'exécution dépasse cette valeur (en ms). Cela permet d'éviter de bloquer les pages web si le temps d'exécution initial de l'analyse est trop long.",
                "enableThrottleApplyClassChanges": "Ralenti l'application par Page Shadow des changements de classes CSS aux éléments. Cela peut améliorer les performances dans certains scénarios.",
                "enableURLChangeDetection": "Active la détection du changement d'adresse URL sur les applications SPA (single page application), ce qui permet à Page Shadow de réappliquer les paramètres et filtres selon la nouvelle URL. Désactiver cette option peut améliorer les performances sur certains sites web qui modifient souvent leur URL.",
                "enablePseudoElementsAnalysis": "Active l'analyse des pseudo-éléments (couleur du texte, arrière-plans notamment). Désactiver cette option peut améliorer les performances, mais peut provoquer des problèmes d'affichage.",
                "enableDarkImageDetectionCache": "Active la mise en cache des images déjà analysées par le moteur d'analyse. Cela améliore les performances en évitant de réanalyser les images déjà analysées. Seuls sont mis en cache l'URL et le résultat de l'analyse des images déjà analysées. Le cache est géré par page.",
                "darkImageDetectionMaxCacheSize": "Paramètre la taille maximale du cache (nombre d'éléments) des images déjà analysées. Si la taille dépasse ce seuil, les plus anciennes analyses seront purgées du cache, pour éviter une utilisation mémoire trop élevée.",
                "mutationObserverProcessNewestFirst": "Si cette option est activée, les mutations les plus récentes seront prises en compte en priorité par rapport aux plus anciennes. Cela n'impacte pas les performances, et n'est utile que pour certains sites web.",
                "enableSelectiveInvertPreserveColors": "Si cette option est activée, le filtre d'inversion sélective tentera de préserver les couleurs originales tout en inversant uniquement le noir et le blanc.",
                "darkThemeDetectionMaxLightness": "Définit la valeur maximale de luminosité qu'un élément doit avoir pour être considéré comme sombre. Cette valeur doit être comprise entre 0 et 1 (pourcentage).",
                "darkThemeDetectionMaxSaturation": "Définit la saturation maximale qu'un élément doit avoir pour être considéré comme sombre. Cette valeur doit être comprise entre 0 et 1 (pourcentage).",
                "darkThemeDetectionMinLightnessLightElements": "Définit la luminosité minimale qu'un élément doit avoir pour être considéré comme clair. Les éléments dont la luminosité est supérieure à cette valeur seront considérés comme clairs. Cette valeur doit être comprise entre 0 et 1 (pourcentage).",
                "darkThemeDetectionPercentageRatioDarkLightElements": "Définit le ratio (en pourcentage, entre 0 et 1) entre les éléments sombres et clairs pour déterminer si un site web utilise un thème sombre.",
                "darkImageDetectionEnableFetchUseHref": "Si cette option est activée, Page Shadow effectuera une requête vers le fichier SVG référencé par une balise HTML use. Cela peut permettre d'analyser certaines images SVG supplémentaires.",
                "darkImageDetectionEnableCorsFetch": "Si cette option est activée, Page Shadow récupérera les images hébergées sur des domaines tiers via son script d'arrière-plan pour contourner les restrictions CORS. Si elle est désactivée, une autre méthode sera utilisée pour gérer ces restrictions.",
                "darkImageDetectionEnableRedirectionCheck": "Si cette option est activée, Page Shadow enverra une requête HEAD au serveur hébergeant l'image pour vérifier si elle provient d'une origine différente (par exemple, en cas de redirection vers une autre origine). Cela permet à Page Shadow de s'adapter et d'éviter les problèmes liés aux restrictions CORS."
            }
        },
        "filtersConfigCategories": {
            "general": "Général",
            "mutationsObservers": "Mutation observers",
            "shadowRoots": "Shadow DOM",
            "observePageChanges": "Minuteurs d'observation de la page",
            "brightColorAnalysis": "Moteur d'analyse des pages - couleurs vives",
            "backgroundAnalysis": "Moteur d'analyse des pages - arrière-plans transparents",
            "generalPageAnalysis": "Moteur d'analyse des pages - général",
            "filterEngine": "Moteur des filtres",
            "imageAnalyze": "Moteur d'analyse des pages - images",
            "applyCssTimer": "Minuteur d'application des changements de classes CSS",
            "others": "Autres options",
            "darkThemeDetection": "Moteur d'analyse des pages - détection des sites ayant un thème sombre",
            "descriptions": {
                "general": "Options globales affectant le comportement général de l'extension.",
                "mutationsObservers": "Les mutation observers sont utilisés pour surveiller et réagir aux changements dynamiques des pages web. Par exemple, cela permet à l'extension de détecter et réagir aux modifications de style et d'attributs des éléments des pages web, ou des modifications de la structure des pages.",
                "shadowRoots": "Ces paramètres contrôlent l'interaction de Page Shadow avec les Shadow DOM. Utilisez-les pour définir comment les styles sont appliqués et les changements sont surveillés dans des composants Shadow DOM.",
                "observePageChanges": "Ces options gèrent le fonctionnement des minuteurs utilisés pour observer certains changements des pages web.",
                "brightColorAnalysis": "Ces options gèrent le moteur chargé d'analyser les couleurs vives présentes sur les pages web. Il analyse les couleurs des textes et des arrière-plans des éléments à la recherche de couleurs vives.",
                "backgroundAnalysis": "Ces options gèrent le moteur chargé d'analyser les arrière-plans des éléments présents sur les pages web et de détecter les arrière-plans transparents.",
                "generalPageAnalysis": "Ces options gèrent le moteur d'analyse des éléments des pages web.",
                "filterEngine": "Ces options gèrent le fonctionnement du moteur de filtre de Page Shadow.",
                "imageAnalyze": "Ces options gèrent le moteur chargé d'analyser les images et chargé de détecter les images avec du texte ou autres éléments sombres. Les résultats des analyses sont utilisés pour la fonctionnalité Inverser les couleurs > Sélectif.",
                "applyCssTimer": "Ces options gèrent le fonctionnement du minuteur chargé d'appliquer les changements de classes CSS des éléments par Page Shadow sur les pages web.",
                "others": "Autres options avancées.",
                "darkThemeDetection": "Ces options gèrent le moteur chargé de détecter les sites web ayant un thème sombre."
            }
        },
        "saved": "Sauvegardé !"
    },
    "modal": {
        "syntax": {
            "title": "Syntaxe de la liste",
            "content": "<ul><li>Vous pouvez entrer des domaines (par exemple <strong>www.google.fr</strong>). Dans ce cas, seul ce domaine exact sera {{excluded}} et non pas ses sous-domaines.</li><li>Vous pouvez entrer des adresses URL entières (par exemple <strong>https://www.google.fr/maps</strong>). Dans ce cas, seule cette adresse exacte sera {{excluded2}}.</li><li>Vous pouvez utiliser le caractère joker <strong>*</strong> qui remplace 0, 1 ou plusieurs caractères : <strong>https://www.google.fr/maps*</strong> {{bloqued}} toutes les adresses URL commençant par cette occurence (par exemple https://www.google.fr/maps/blabla mais pas https://www.google.fr/blabla).</li><li>Vous pouvez placer le caractère joker <strong>*</strong> plusieurs fois et où vous le souhaitez. Ainsi, <strong>*.google.*</strong> {{bloqued}} tous les sous-domaines et tous les domaines de premier niveau de Google (par exemple google.fr, google.com, www.google.com, …).</li><li>Vous pouvez aussi utiliser des expressions régulières (commençant et terminant par <strong>/</strong>).<br />Exemple : <strong>/(.*).google.(.*)/</strong></li><li>Vous pouvez commenter une ligne en mettant un <strong>#</strong> au début de celle-ci.</li><li>Toute entrée invalide sera ignorée sans avertissement.</li>",
            "excluded": "exclu",
            "excluded2": "exclue",
            "bloqued": "bloquera",
            "detected": "détecté",
            "detected2": "détectée",
            "detected3": "détectera"
        },
        "about": {
            "title": "À propos de Page Shadow",
            "description": "Page Shadow est disponible sur Firefox, Chrome, Opera et Microsoft Edge. Cette extension est conçue par Eliastik",
            "readme": "Fichier Lisez-moi",
            "homepage": "Page officielle",
            "contact": {
                "title": "Contacter le développeur",
                "email": "Par e-mail",
                "github": "Via Github (issues)",
                "report": "Signaler un problème d'affichage sur une page web"
            },
            "webpage": "Page web de Page Shadow :",
            "version": "Version actuelle :",
            "versionDate": "Date de la version :",
            "browser": "Votre navigateur web :",
            "changelogTitle": "Journal des changements",
            "infos": "Informations",
            "changelog": {
                "2_11_1": "<ul><li>Détection automatique des thèmes sombres : Page Shadow peut désormais identifier les sites web utilisant un thème sombre. Grâce à cette fonctionnalité, vous pouvez configurer l'extension pour :</li><ul><li>Se désactiver automatiquement sur les sites ou pages avec un thème sombre ;</li><li>Activer automatiquement un pré-réglage spécifique si un thème sombre est détecté.</li></ul><li>Correction de bugs et améliorations techniques (voir le fichier Lisez-moi).</li></ul>",
                "2_11": "<ul><li>Ajout de la possibilité d'activer l'inversion ou l'atténuation des éléments colorés. Il est possible ainsi de désactiver l'inversion des éléments colorés en activant l'inversion de la page entière, pour un mode sombre alternatif à la fonction Augmenter le contraste ;</li><li>Ajout de la possibilité de modifier l'intensité du filtre de la fonction Atténuer les couleurs ;</li><li>Les éléments textuels colorés sont désormais détectés par Page Shadow. Ainsi, ils sont pris en compte par les différentes fonctions gérant les éléments colorés : Augmenter le contraste, Inverser les couleurs et Atténuer les couleurs ;</li><li>Lors de l'ouverture d'une nouvelle page, les fonctionnalités Baisser la luminosité, Filtre de réduction de la lumière bleue et Inverser la page entière sont appliquées plus rapidement afin d'éviter l'affichage d'un flash pouvant être désagréable, grâce à une optimisation des performances ;</li><li>La fonction d'inversion sélective a été améliorée : elle préserve autant que possible les couleurs originales des images tout en inversant les couleurs noires et sombres en blanc, afin de rendre les éléments plus visibles sur un fond sombre ;</li><li>L'algorithme de détection des images comportant des textes/logos ou autres éléments sombres a été revu et amélioré : il est beaucoup plus efficace et plus performant. Il est désormais activé par défaut dans cette version. Pour profiter de cette fonctionnalité, il faut activer la fonction Inverser les couleurs &gt; Sélectif afin d'inverser les images détectées, afin qu'elles soient plus lisibles sur un fond sombre (plus d'infos dans le fichier Lisez-moi) ;</li><li>Une attention particulière a été portée à l'optimisation des performances de l'extension : l'extension s'adapte désormais aux performances de l'appareil et la complexité des pages web pour le moteur d'analyse des pages. Ainsi, le nombre d'éléments analysés s'adapte automatiquement en fonction du contexte pour de meilleures performances. D'autres optimisations ont également été apportées, améliorant considérablement les performances de l'extension (plus d'infos dans le fichier Lisez-moi) ;</li><li>Ajout de la possibilité de signaler un problème d'affichage des fonctionnalités de Page Shadow sur les pages web au développeur de l'extension : cela transmet l'URL de la page au développeur après le consentement de l'utilisateur, afin de l'aider à corriger le problème ;</li><li>Correction de problèmes avec l'archivage Cloud des paramètres de Page Shadow : dans certains cas, il était possible que l'archivage échoue, à cause de l'algorithme de chunking utilisé par Page Shadow. L'algorithme a été corrigé, ce qui corrige ces problèmes. Les archives Cloud existantes ne sont pas impactées ;</li><li>Ajout de 5 slots de pré-réglages supplémentaires (portant leur nombre à 15) ainsi que 5 slots de thèmes personnalisés supplémentaires (portant leur nombre à 10) ;</li><li>L'extension détecte désormais les éléments sur lesquels un filtre était appliqué, mais suite à certains changements, si le filtre ne doit plus s'appliquer à l'élément, celui-ci est désormais retiré ;</li><li>Les arrière-plans sous forme de dégradés colorés sont désormais détectés par l'extension ;</li><li>L'interface des options avancées de l'extension a été revue, les options sont désormais groupées par catégories ;</li><li>Amélioration du support des Shadow DOM : l'extension analyse désormais les éléments contenus dans un Shadow DOM. D'autres corrections apportent une meilleure compatibilité avec les sites utilisant cette technologie ;</li><li>Amélioration du support des pseudo-éléments : l'extension analyse désormais les pseudo-éléments afin d'améliorer l'affichage sur les sites web utilisant cette fonctionnalité ;</li><li>Correction d'autres bugs et améliorations techniques (voir le fichier Lisez-moi).</li></ul>",
                "2104": "<ul><li>Ajout d'un nouveau thème de popup : le thème \"Compact\". Comme son nom l'indique, les éléments de ce thème ont été optimisés pour réduire la hauteur de la popup de Page Shadow ;</li><li>Le thème \"Moderne\" a été également optimisé par la modification de l'option \"Appliquer les paramètres en temps réel\" qui prend moins de place ;</li><li>L'interface globable de l'extension a été modifiée, la plupart des éléments ont été arrondis ;</li><li>Amélioration des performances lors de l'ouverture d'une nouvelle page avec l'utilisation de la fonctionnalité \"Augmenter le contraste\" : auparavant, un flash pouvait être parfois observé le temps que la fonctionnalité soit appliquée sur la nouvelle page. Grâce à des optimisations de performances, ce flash a complètement été enlevé ;</li><li>La fonctionnalité d'archivage des paramètres dans le Cloud a été améliorée et des bugs ont été corrigés (voir le fichier Lisez-moi) ;</li><li>Ajout expérimentale d'une détection automatique des images sombres pour la fonctionnalité Inverser les couleurs > Sélectif. Par défaut, cette fonctionnalité n'est cependant pas activée. Elle peut être activée dans les options avancées de l'extension ;</li><li>Correction de bugs (voir le fichier Lisez-moi).</li></ul>",
                "2103": "<ul><li>Amélioration majeure de l'affichage lorsque la fonction Conserver les couleurs des éléments est activée avec la fonction Augmenter le contraste : des problèmes d'affichage pouvaient se produire, ils ont été corrigés. La fonction de préservation des couleurs est donc activée par défaut pour les nouvelles installations ;</li><li>Dans le cas où certaines permissions importantes pour le fonctionnement de l'extension ne sont pas autorisées, une alerte s'affiche désormais sur la popup proposant de les autoriser ;</li><li>Petits ajustements de l'interface utilisateur : les éléments ont été rendus plus arrondis, d'autres ajustements ont été effectués ;</li><li>L'avertissement s'affichant si on quitte/actualise la page des Paramètres avancés ne s'affiche désormais que si des modifications non enregistrées ont été effectuées ;</li><li>Modifications préparant la sortie de la version basée sur l'API Manifestv3 pour Firefox (cette version fonctionne encore sous Manifestv2 pour ce navigateur, la sortie de la version se basant sur MV3 se fera plus tard) ;</li><li>Corrections de bugs et améliorations techniques (voir le fichier Lisez-moi).</li></ul>",
                "2102": "<ul><li>Migration vers l'API Manifest v3 (versions Chrome/Edge/Opera uniquement). Les impacts sur les fonctionnalités de Page Shadow sont très mineurs (voir le fichier Lisez-moi) ;</li><li>Ajout de la fonctionnalité Atténuer les couleurs (remplaçant la fonctionnalité Atténuer la couleur des images), qui permet d'atténuer la couleur des images/arrière-plans/vidéos et éléments colorés ;</li><li>Correction des bugs (voir le fichier Lisez-moi)</li></ul>",
                "2101": "<ul><li>Optimisation majeure des performances, ce qui permet de limiter l'apparition de flashs lors de la navigation entre pages ou le changement des paramètres en temps réel ;</li><li>Ajout de la fonction \"Préserver les couleurs des éléments\" (non activée par défaut) à la fonction \"Augmenter le contraste\". Cette fonction préserve les couleurs des éléments, mais remplace les couleurs très proches du blanc ou les couleurs sombres ;</li><li>Amélioration de l'expérience d'utilisation lorsque le thème de la popup \"Moderne\" est activé. Ce thème est désormais le thème par défaut pour les nouvelles installations ;</li><li>Améliorations mineures de l'interface des Paramètres avancés : affichage d'une icône sur les onglets si des modifications des paramètres n'ont pas été enregistrées, affichage d'un témoin de chargement lors de la restauration des archives des paramètres ;</li><li>Ajout du paramètre \"Activer le menu du clic droit\" (activé par défaut) ;</li><li>Corrections de bugs et améliorations techniques (voir le fichier Lisez-moi)</li></ul>",
                "210": "<ul><li>Page Shadow a subit une refonte de son interface graphique. De nombreuses nouveautés sont disponibles (voir le fichier Lisez-moi) ;</li><li>Séparation du \"Mode nuit\" de la fonction \"Baisser la luminosité de la page\" : le \"Mode nuit\" est désormais une fonction à part, nommée \"Filtre de réduction de la lumière bleue\" ;</li><li>Ajout de la fonction \"Atténuer la couleur des images\" permettant d'éviter d'afficher des couleurs trop vives ;</li><li>Il est désormais possible d'archiver automatiquement les paramètres de Page Shadow dans le Cloud, à un intervalle paramétrable (par défaut, cette fonctionnalité est désactivée) ;</li><li>Un avertissement est désormais affiché pour avertir de l'importance d'effectuer une archive de ses paramètres de l'extension ;</li><li>Optimisation du téléchargement et de la mise à jour automatique des filtres : ceux-ci sont mis à jour uniquement si nécessaire (date de dernière mise à jour du fichier sur le serveur). Si une mise à jour est nécessaire, un message est affiché au niveau de la liste des filtres ;</li><li>Ajout d'options avancées pour les utilisateurs avertis dans les Paramètres avancés ;</li><li>Corrections de bugs et améliorations techniques (voir le fichier Lisez-moi)</li></ul>",
                "291": "<ul><li>Amélioration des performances lors de l'activation/désactivation de Page Shadow et lors de la modification des paramètres ;</li><li>Amélioration des performances du traitement des pages web par Page Shadow ;</li><li>Il est désormais possible d'indiquer une couleur en RGB ou en HSV dans les paramètres des thèmes personnalisés ;</li><li>Ajout d'une liste optionnelle \"Mode ultra performance\" ;</li><li>Ajout du thème n°16 ;</li><li>Correction de bugs (voir le fichier Lisez-moi) ;</li><li>Améliorations techniques (voir le fichier Lisez-moi)</li></ul>",
                "29": "<ul><li>Ajout de la possibilité de créer un pré-réglage et de mettre à jour un pré-réglage avec les paramètres actuels directement dans le menu de l'extension ;</li><li>Ajout du paramétrage \"Sélectif\" pour la fonctionnalité \"Inverser les couleurs\" : ce paramètrage, basé sur la fonctionnalité des filtres, permet d'inverser les couleurs d'un nombre restreint d'éléments qui peuvent mal s'afficher sur un thème sombre de la fonctionnalité Augmenter le contraste (voir le fichier Lisez-moi) ;</li><li>Amélioration de l'affichage de la fonctionnalité Augmenter le contraste sur la plupart des sites web (voir le fichier Lisez-moi) ;</li><li>Les pré-réglages activés pour une page web ont désormais une plus grande priorité par rapport à ceux activés pour le site web globalement ;</li><li>Amélioration de la fonctinnalité Filtres (paramètres avancés) (voir le fichier Lisez-moi) ;</li><li>Lors de la modification des thèmes personnalisés ou des pré-réglages dans les paramètres avancés, Page Shadow vous averti si les changements apportés aux paramètrages n'ont pas été enregistrés ;</li><li>Amélioration des performances (voir le fichier Lisez-moi) ;</li><li>Correction de bugs (voir le fichier Lisez-moi) ;</li><li>Amélioration techniques (voir le fichier Lisez-moi)</li></ul>",
                "28": "<ul><li>Ajout de la fonctionnalité Filtres, accessible dans les Paramètres avancés. Les filtres permettent, à partir de règles, d'améliorer l'affichage des sites web lorsque les options suivantes sont activées : Augmenter le contraste ou Inverser les couleurs. Cette avancée améliore considérablement l'affichage de certains sites web lorsque Page Shadow est activé. Cette fonctionnalité permet également d'améliorer les performances de Page Shadow sur certains sites web. Ces filtres sont quotidiennement mis à jour à partir de sources Internet. Les listes fournies par défaut sont téléchargées depuis le site web eliastiksofts.com (site web du développeur de l'extension). Il est également possible de définir des règles personnalisées. Vous n'avez rien à faire de plus de votre côté pour profiter de la fonctionnalité, elle est opérationnelle dès l'installation/mise à jour de l'extension. Les filtres sont mis à jour automatiquement ;</li><li>Ajout de la possibilité de définir une liste de sites/pages où activer automatiquement un pré-réglage : il est possible de définir cette liste à l'aide de cases à cocher disponibles dans le menu de l'extension, ou en définissant une liste manuellement (la syntaxe est la même que la fonctionnalité permettant de désactiver un site/une page, et supporte les expressions régulières et les jokers) ;</li><li>Il est désormais possible d'appliquer les pré-réglages à l'aide de raccourcis clavier (à paramétrer manuellement) ;</li><li>Le nombre maximum de pré-réglages enregistrables est passé de 5 à 10 ;</li><li>Il est désormais possible de voir les paramètres stockés dans les pré-réglages dans les Paramètres avancés ;</li><li>Affichage d'une notification lorsque l'extension a été mise à jour ;</li><li>Corrections de nombreux bugs, amélioration des performances et autres ajustements (voir le fichier Lisez-moi) ;</li><li>Améliorations techniques (voir le fichier Lisez-moi).</li></ul>",
                "27": "<ul><li>Ajout de la possibilité de créer plusieurs thèmes personnalisés au lieu d'un seul auparavant ;</li><li>Ajout de Archive Cloud dans Archives et pré-réglages des Paramètres avancés ;</li><li>Amélioration de la liste noire/blanche avec plus d'options de blocage (joker *, expressions régulières, etc.) ;</li><li>La liste blanche supporte désormais les mêmes options que la liste noire, auparavant elle acceptait uniquement les domaines ;</li><li>Corrections de bugs et des textes.</li></ul>",
                "26": "<ul><li>Ajout de la possibilité de définir des pré-réglages (5 max, pouvant être créés depuis les paramètres avancés) afin de les restaurer plus tard (via le menu de l'extension, les paramètres avancés ou le menu du clic-droit) ;</li><li>Ajout d'un raccourci clavier (Alt+Shift+S) permettant d'activer/désactiver l'extension globalement ;</li><li>Ajout des éléments Vidéos et Arrière-plans (images) dans la fonction Inverser les couleurs, ils peuvent ainsi être inversés ou non indépendamment de la page entière et des images ;</li><li>Ajout de la possibilité d'activer ou de désactiver la coloration de l'arrière-plan des images lorsque la fonction Augmenter le contraste de la page est activée ;</li><li>Correction de l'affichage de certains éléments qui pouvaient être masqués lorsque la fonction Augmenter le contraste de la page était activée (par exemple Google Actualités) ;</li><li>L'espace pris par le menu de l'extension a été réduit afin d'accueillir les nouvelles fonctions ;</li><li>Autres changements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "25": "<ul><li>Meilleur rendu de l'outil Augmenter le contraste de la page + contraste de couleurs des thèmes corrigé ;</li><li>Ajout de la possibilité d'activer ou de désactiver l'extension en un clic ;</li><li>Ajout de l'outil Activer/désactiver automatiquement qui permet d'activer et/ou de désactiver automatiquement Page Shadow selon l'heure de la journée ;</li><li>Ajout de la possibilité d'écrire une feuille de style CSS personnalisé pour le thème personnalisé ;</li><li>Ajout d'une fonction d'archivage/restauration des paramètres de Page Shadow ;</li><li>L'outil Inverser les couleurs des images a été renommé en Inverser les couleurs car il permet désormais d'inverser les couleurs des images et/ou de la page entière indiféremment ;</li><li>Amélioration de la détection des images pour l'outil Inverser les couleurs ;</li><li>L'icône de l'extension change en fonction de son état d'activation sur la page actuelle (rouge/vert) ;</li><li>Autres changements mineurs, corrections de bugs et améliorations des performances (voir le fichier Lisez-moi).</li></ul>",
                "24": "<ul><li>Ajout de la possibilité d'inverser les couleurs des pages web entièrement, et non pas seulement les images ;</li><li>Ajout de nouvelles options pour les thèmes personnalisés : couleur des liens visités et police de caractères ;</li><li>Les thèmes ont désormais une couleur pour les liens visités ;</li><li>Ajout de la possibilité de désactiver l'affichage du message après avoir selectionné le thème personnalisé pour l'outil Augmenter le contraste de la page ;</li><li>Corrections de bugs, amélioration des performances et ajustements (voir le fichier Lisez-moi).</li></ul>",
                "23": "<ul><li>Ajout de la possibilité de créer un thème personnalisé ;</li><li>Amélioration de l'outil Inverser les couleurs des images : les images d'arrière-plan sont désormais détectées, ce qui améliore grandement le rendu de l'outil ;</li><li>Corrections de bugs et ajustements (voir le fichier Lisez-moi).</li></ul>",
                "22": "<ul><li>Ajout de 5 nouveaux thèmes (10 à 15) ;</li><li>Corrections de bugs, changements importants dans la structure de l'extension et ajustements mineurs, notamment : <ul><li>Optimisations et changements importants dans le code de la gestion des paramètres (détection dynamique des changements en temps réel) ;</li><li>Corrections de bugs pour Firefox pour Android : la désactivation  de l'extension pour un site ou une page fonctionne désormais, le panneau des paramètres principal défile désormais correctement ;</li><li>Correction d'un bug de l'outil Baisser la luminosité de la page : dans certains cas, le pourcentage de baisse de la luminosité pouvait être incorrect, ce rendait le panneau des paramètres entièrement sombre ;</li></ul></li><li>Pour le reste des changements, voir le fichier Lisez-moi.</li></ul>",
                "211": "<ul><li>Erreur de parsing XML avec Firefox corrigé (bug avec i18nextXHRBackend) ;</li><li>Les paramètres sont désormais initialisés dès l'installation de l'extension ;</li><li>Bug corrigé avec le fichier manifeste pour Microsoft Edge (clé persistent dans la clé background).</li></ul>",
                "21": "<ul><li>Amélioration des performances par la correction d'un bug : le processeur pouvait être occupé à plus de 50% dans certains cas particuliers ;</li><li>Ajout de la possibilité de basculer la liste des sites à ignorer en liste blanche : tous les sites sont dans ce cas ignorés, et il faut les débloquer manuellement ;</li><li>Ajout de la possibilité de choisir la température de couleur utilisée par le Mode nuit ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "203": "<ul><li>Il est désormais possible de désactiver Page Shadow pour un site ou une page particulière via le clic-droit ou via le menu de l'extension ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                "202": "<ul><li>Les paramètres peuvent désormais être appliqués en temps réel ;</li><li>Correction de l'icône de Page Shadow (l'ombre est de meilleure qualité) ;</li><li>Corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                "201": "<ul><li>Compatibilité Microsoft Edge ;</li><li>Amélioration des performances et corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                "2": "<ul><li>Compatibilité Firefox ;</li><li>Nouveau thème graphique basé sur Bootstrap ;</li><li>Moteur de traduction intégré et ajout d'une traduction en anglais ;</li><li>Ajout de thèmes de couleur pour l'outil \"Augmenter le contraste\" ;</li><li>Ajout d'un mode nuit ;</li><li>Ajout d'un mode permettant d'inverser la couleur des images ;</li><li>Amélioration des performances ;</li><li>Corrections diverses (bugs, textes).</li></ul>",
                "121": "<ul><li>Correction d'un bug dans les paramètres avancés ;</li><li>Ajout d'informations sur l'application dans les paramètres avancés.</li></ul>",
                "12": "<ul><li>Optimisation de la mise en page de la popup ;</li><li>Amélioration de l'outil \"Augmenter le contraste\". Les images transparentes sont désormais prises en charge ;</li><li>Quelques ajustements.</li></ul>",
                "11": "<ul><li>Amélioration de la fonction \"Augmenter le contraste\".</li></ul>",
                "1": "<ul><li>Version initiale.</li></ul>",
                "versionNames": {
                    "2_11_1": "Version 2.11.1 (09/01/2025)",
                    "2_11": "Version 2.11 (22/12/2024)",
                    "2104": "Version 2.10.4 (09/06/2024)",
                    "2103": "Version 2.10.3 (05/03/2023)",
                    "2102": "Version 2.10.2 (01/11/2022)",
                    "2101": "Version 2.10.1 (25/09/2022)",
                    "210": "Version 2.10 (18/08/2022)",
                    "291": "Version 2.9.1 (26/12/2021)",
                    "29": "Version 2.9 (12/12/2021)",
                    "28": "Version 2.8 (24/10/2021)",
                    "27": "Version 2.7 (16/08/2019)",
                    "26": "Version 2.6 (31/10/2018)",
                    "25": "Version 2.5 (29/04/2018)",
                    "24": "Version 2.4 (02/01/2018)",
                    "23": "Version 2.3 (1/12/2017)",
                    "22": "Version 2.2 (25/10/2017)",
                    "211": "Version 2.1.1 (09/09/2017)",
                    "21": "Version 2.1 (04/09/2017)",
                    "203": "Version 2.0.3 (09/07/2017)",
                    "202": "Version 2.0.2 (17/06/2017)",
                    "201": "Version 2.0.1 (09/06/2017)",
                    "2": "Version 2.0 (05/06/2017)",
                    "12": "Version 1.2",
                    "11": "Version 1.1",
                    "1": "Version 1.0"
                }
            }
        },
        "readme": {
            "title": "Fichier Lisez-moi",
            "src": "README_FR.txt"
        },
        "customTheme": {
            "title": "Paramètres des thèmes personnalisés",
            "description": "Ici, vous pouvez paramétrer vos thèmes personnalisés. Pour modifier les couleurs du thème, cliquez sur les cercles colorés et choisissez une couleur.",
            "saveInfo": "Pour sauvegarder vos paramètres, cliquez sur le bouton « Enregistrer » en dessous du sélecteur de thème.",
            "slot": "Slot :",
            "save": "Enregistrer",
            "saved": "Enregistré !",
            "cancel": "Annuler",
            "reset": "Réinitialiser",
            "background": "Couleur de fond :",
            "texts": "Couleur des textes :",
            "links": "Couleur des liens :",
            "linksVisited": "Couleur des liens visités :",
            "font": "Police de caractères :",
            "placeholderFont": "Nom d'une police…",
            "fontHelp": "Entrez le nom d'une police de caractères installée sur votre appareil, elle remplacera la police de caractères par défaut des pages web. Entrer une valeur vide n'a aucun effet et équivaut à désactiver cette option.",
            "preview": "Prévisualisation :",
            "previewText": "Un texte.",
            "previewLink": "Un lien.",
            "previewLinkVisited": "Un lien visité.",
            "collapseCustomCSS": "Feuille de style CSS personnalisée…",
            "customCSSHelp": "Vous pouvez écrire ci-dessous une feuille de style CSS personnalisée qui sera chargée en même temps que le thème personnalisé.",
            "customCSSHelpExpUsers": "Pour les utilisateurs expérimentés uniquement.",
            "customCSSHelpSuggestions": "Appuyez sur Ctrl+Espace pour afficher des suggestions lorsque vous écrivez votre feuille de style.",
            "fontNotCompatible": "Ce paramètre est incompatible avec votre navigateur web.",
            "firefoxLinuxBugFonts": "Il est possible que ce paramètre ne soit pas fonctionnel sur votre système.",
            "notifyThemeChangedNotSaved": "Vous n'avez pas enregistré les modifications apportées au thème. Voulez-vous vraiment continuer ? Dans ce cas, vous perdrez vos modifications.",
            "notifyThemeChangedNotSavedInfo": "Attention, vous n'avez pas enregistré les modifications apportées au thème. Ouvrez à nouveau l'onglet des Thèmes personnalisés si vous souhaitez enregistrer vos modifications.",
            "chooseTheme": "Thème :"
        },
        "archive": {
            "title": "Archivage, restauration des paramètres et pré-réglages",
            "archive": "Archiver",
            "restore": "Restaurer",
            "descriptionArchive": "Vous pouvez effectuer une sauvegarde de vos paramètres en enregistrant un fichier d'archive sur votre appareil en cliquant sur le bouton ci-dessous. Ainsi, vous pourrez le restaurer plus tard. Les fichiers d'archives sont au format JSON.",
            "buttonArchive": "Archiver les paramètres…",
            "archiveError": "Une erreur est survenue. Veuillez réessayer.",
            "firefoxHelp": "Sur Firefox, à cause d'un problème, le nom du fichier archive proposé au téléchargement peut être invalide. Il suffit de renommer le fichier en changeant l'extension en .json pour qu'il puisse être restauré plus tard.",
            "helpArchive": "Si le fichier archive n'a pas pu être enregistré, copiez-collez le texte suivant dans un éditeur de texte en l'enregistrant au format JSON (extension en .json) :",
            "suggestedName": "Nom de fichier suggéré :",
            "descriptionRestore": "Vous pouvez restaurer une archive de vos paramètres en cliquant sur le bouton ci-dessous, puis en choisissant le fichier de l'archive sur votre appareil (au format JSON).",
            "warningRestore": "Attention, la restauration de l'archive remplacera tous vos paramètres actuels !",
            "buttonRestore": "Restaurer les paramètres…",
            "restoreError": "Une erreur est survenue lors de la restauration des données. Assurez-vous que le fichier choisi soit bien un fichier d'archive de paramètres Page Shadow au format JSON, puis réessayez.",
            "restoreErrorFilesize": "Fichier d'archive trop lourd. La taille maximale supportée d'un fichier d'archive est de 100 Mo.",
            "restoreErrorExtension": "Fichier invalide. Le fichier doit être un fichier au format JSON.",
            "restoreErrorArchive": "Ce fichier n'est pas une archive de paramètres Page Shadow. Assurez-vous d'avoir sélectionné le bon fichier.",
            "restoreSuccess": "Restauration des données effectuée avec succès.",
            "preset": "Pré-réglages",
            "descriptionPreset": "Vous pouvez ici créer des pré-réglages pour pouvoir les restaurer/charger instantanément plus tard. Les réglages sauvegardables correspondent à ceux affichés dans le menu de l'extension. 10 slots de pré-réglages sont disponibles.",
            "descriptionPresetAdvanced": "Les pré-réglages vous permettent également de configurer des paramètres différents pour chaque site web/page web. Par exemple, vous pouvez créer un pré-réglage qui comprend le paramètre « Augmenter le contraste » et « Inverser les couleurs » > « Sélectif », un autre qui comprend le réglage « Baisser la luminosité », etc. Vous pouvez ensuite appliquer l'un des pré-réglages à un site web ou une page web instantanément dans le menu de l'extension, en cliquant sur « Ce site » ou « Cette page » en face de la ligne « Auto activ. du pré-régl. pour ». Vous pouvez aussi paramétrer la liste des sites web/page web directement lorsque vous créez votre pré-réglage.",
            "warningPreset": "Attention, avant de charger un pré-réglage, sauvegardez vos réglages actuels dans un autre slot car ils seront écrasés !",
            "loadPreset": "Charger",
            "savePreset": "Créer/modifier",
            "deletePreset": "Supprimer",
            "loadPresetLabel": "Choisissez un pré-réglage :",
            "presetTitle": "Pré-régl. ",
            "presetEmpty": "Vide",
            "presetTitleEmpty": "Sans titre",
            "restorePresetError": "Une erreur est survenue",
            "restorePresetEmpty": "Impossible de charger ce pré-réglage car il est vide",
            "restorePresetSuccess": "Chargement effectué avec succès",
            "savePresetSelect": "Choisissez un slot :",
            "savePresetTitle": "Nom du pré-réglage (50 carac. max) :",
            "savePresetSuccess": "Pré-réglage créé/modifié avec succès",
            "deletePresetSuccess": "Pré-réglage supprimé avec succès",
            "infoLoadPreset": "Ici, vous pouvez charger un pré-réglage.",
            "infoSavePreset": "Le pré-réglage sera créé/modifié avec les réglages actuels tels qu'affichés dans le menu de l'extension. Si vous modifiez un réglage existant, cochez la case « Sauvegarder les nouveaux réglages » pour mettre à jour les réglages sauvegardés.",
            "infoDeletePreset": "Attention, la suppression est définitive !",
            "cloud": "Cloud",
            "descriptionCloudBackup": "Vous pouvez ici faire une archive de tous vos paramètres dans le Cloud du fournisseur de votre navigateur web (compte Google, Firefox Sync par exemple). Cela vous permettra de récupérer tous vos paramètres sur tous les navigateurs connectés au même compte que celui-ci. Cette fonction dépend de votre navigateur. Si vous n'êtes connecté à aucun compte, l'archive se fera en local.",
            "warningCloudBackup": "Attention en restaurant vos paramètres à partir d'une archive Cloud, tous vos paramètres actuels seront remplacés !",
            "archiveCloudBtn": "Archiver les paramètres…",
            "restoreCloudBtn": "Restaurer les paramètres…",
            "archiveCloudError": "Une erreur est survenue lors de l'archivage des données.",
            "archiveCloudErrorQuota": "Une erreur est survenue lors de l'archivage des données. Vos paramètres dépassent le quota maximum de stockage prévu par l'archivage cloud (voir l'onglet Stockage).",
            "restoreCloudError": "Une erreur est survenue lors de la restauration de l'archive.",
            "archiveCloudSuccess": "Archivage des données effectué avec succès.",
            "restoreCloudSuccess": "Restauration des données effectuée avec succès.",
            "archiveCloudNotCompatible": "Cette fonction n'est pas compatible avec votre navigateur web.",
            "infoCloudLastArchive": "Date de l'archive :",
            "dateCloudLastArchive": "le {{date}} à {{hour}} avec l'appareil {{device}}",
            "savePresetWebsite": "Liste des sites/pages où activer automatiquement le pré-réglage :",
            "checkSaveNewSettingsPreset": "Sauvegarder les nouveaux réglages",
            "infosStorage": "Infos sur le stockage",
            "infosLocalStorage": "Stockage local utilisé :",
            "infosCloudStorage": "Stockage cloud utilisé :",
            "autoBackupCloudLabel": "Archivage automatique dans le Cloud :",
            "autoBackupCloud": {
                "0": "Jamais",
                "3": "Tous les 3 jours",
                "5": "Tous les 5 jours",
                "7": "Tous les 7 jours",
                "14": "Tous les 14 jours",
                "30": "Tous les mois (tous les 30 jours)",
                "60": "Tous les 2 mois (tous les 60 jours)"
            },
            "autoBackupError": "Une erreur est survenue lors du dernier archivage automatique dans le Cloud.",
            "restoring": "Restauration en cours…",
            "archivingCloud": "Archivage en cours…",
            "checkAutoEnablePresetForDarkWebsitesPart1": "Activer automatiquement ce pré-réglage",
            "website": "sur les sites web",
            "webpage": "sur les pages web", 
            "checkAutoEnablePresetForDarkWebsitesPart2": "ayant un thème sombre",
            "checkAutoEnablePresetForDarkWebsitesTitle": "Si Page Shadow détecte qu'un site web/page web a un thème sombre, ce pré-réglage sera automatiquement activé. Ne peut être activé que sur un pré-réglage à la fois. Ne fonctionne que si les options Augmenter le contraste, Inverser les couleurs et/ou Atténuer les couleurs sont appliquées pour le site ou la page, car le moteur d'analyse n'est pas activé dans les autres cas pour des raisons de performance."
        },
        "presets": {
            "pageShadowEnabled": "Augmenter le contraste :",
            "theme": "Thème :",
            "pageLumEnabled": "Baisser la luminosité :",
            "pourcentageLum": "Pourcentage de baisse de la luminosité :",
            "nightModeEnabled": "Mode nuit :",
            "liveSettings": "Application en temps réel des modifications des paramètres :",
            "colorTemp": "Température de couleur du filtre de réduction de la lumière bleue :",
            "colorInvert": "Inverser les couleurs :",
            "invertPageColors": "Inverser les couleurs :",
            "invertImageColors": "Inverser les couleurs des images :",
            "invertEntirePage": "Inverser les couleurs de la page entière :",
            "invertVideoColors": "Inverser les couleurs des vidéos :",
            "invertBgColor": "Inverser les couleurs des images d'arrière-plan :",
            "autoEnable": "Activation automatique selon l'heure :",
            "disableImgBgColor": "Désactiver la coloration de l'arrière-plan des images :",
            "selectiveInvert": "Inversion sélective :",
            "invertBrightColors": "Inverser les éléments colorés :",
            "attenuateImageColor": "Atténuer la couleur des images :",
            "attenuateColors": "Atténuer les couleurs :",
            "attenuateImgColors": "Atténuer les couleurs des images :",
            "attenuateBgColors": "Atténuer les couleurs des images d'arrière-plan :",
            "attenuateVideoColors": "Atténuer les couleurs des vidéos :",
            "attenuateBrightColors": "Atténuer la couleur des éléments colorés :",
            "blueLightReductionEnabled": "Filtre de réduction de la lumière bleue :",
            "percentageBlueLightReduction": "Intensité du filtre de réduction de la lumière bleue :",
            "percentageAttenuateColors": "Intensité du filtre d'atténuation des couleurs :",
            "brightColorPreservation": "Préserver les couleurs des éléments :",
            "presetInfosLabel": "Détails du pré-réglage",
            "enabled": "Activé",
            "disabled": "Désactivé",
            "customTheme": "Thème personnalisé n°{{count}}",
            "themeNumber": "Thème n°{{count}}",
            "undefined": "(Non défini)",
            "notifyPresetChangedNotSaved": "Vous n'avez pas enregistré les modifications apportées au pré-réglage. Voulez-vous vraiment continuer ? Dans ce cas, vous perdrez vos modifications.",
            "notifyPresetChangedNotSavedInfo": "Attention, vous n'avez pas enregistré les modifications apportées au pré-réglage. Ouvrez à nouveau l'onglet Pré-réglages > Créer/modifier si vous souhaitez enregistrer vos modifications."
        },
        "saved": {
            "title": "Information",
            "message": "Paramètres sauvegardés !"
        },
        "reset": {
            "title": "Information",
            "message": "Tous les paramètres ont été réinitialisés !"
        },
        "resetConfirm": {
            "title": "Confirmation",
            "message": "Êtes-vous sûr de vouloir réinitialiser tous les paramètres de l'extension ?"
        },
        "filters": {
            "title": "Filtres",
            "infos": "Les filtres permettent d'améliorer la compatibilité de Page Shadow avec les sites web en corrigeant les problèmes d'affichage. Ces filtres sont utilisés par la fonctionnalité Augmenter le contraste et Inverser les couleurs. Ces filtres sont téléchargés depuis des sources en ligne. Ils sont automatiquement mis à jour, et il est également possible de le faire manuellement. Vous pouvez également écrire vos propres règles de filtre.",
            "updateAll": "Tout mettre à jour",
            "addFilter": "Ajouter une source de filtre",
            "lastUpdate": "Dernière mise à jour le : {{date}} à {{hour}}",
            "lastUpdateNever": "Dernière mise à jour le : jamais",
            "errorUpdate": "Erreur lors de la dernière mise à jour",
            "filterDetails": "Détails du filtre",
            "cleanAll": "Vider tous les caches",
            "addFilterTitle": "Ajouter une source de filtre",
            "addFilterInfos": "Entrez ci-dessous l'adresse vers la source de filtre :",
            "addFilterAddress": "Adresse du filtre :",
            "addFilterErrorEmpty": "Vous n'avez rien entré.",
            "addFilterErrorFetch": "Erreur lors de la connexion à l'adresse entrée.",
            "addFilterErrorParsing": "Erreur lors de la récupération des données du filtre. Assurez-vous qu'il s'agisse bien d'un filtre Page Shadow.",
            "addFilterErrorAlreadyAdded": "Ce filtre a déjà été ajouté.",
            "addFilterErrorUnknown": "Une erreur inconnue est survenue.",
            "seeDetails": "Voir les détails du filtre",
            "homepage": "Page d'accueil de la source",
            "deleteSource": "Supprimer cette source",
            "updateFilter": "Mettre à jour le filtre",
            "editFilter": "Éditer votre filtre",
            "enableFilterAutoUpdate": "Activer les mises à jour automatiques",
            "editFilterTitle": "Édition du filtre",
            "save": "Sauvegarder",
            "cancel": "Annuler les modifications",
            "guide": "Guide de la syntaxe",
            "saved": "Sauvegardé !",
            "filterInfosLabel": "Informations avancées du filtre",
            "filterName": "Nom du filtre :",
            "filterSource": "Source du filtre :",
            "filterHome": "Page d'accueil du filtre :",
            "filterDescription": "Description du filtre :",
            "filterUpdateInterval": "Intervalle de mise à jour automatique :",
            "filterUpdateIntervalDays_zero": "{{count}} jour",
            "filterUpdateIntervalDays_one": "{{count}} jour",
            "filterUpdateIntervalDays_other": "{{count}} jours",
            "filterDescriptionEmpty": "(Vide)",
            "version": "Version :",
            "license": "Licence :",
            "licenseEmpty": "(Non renseigné)",
            "rulesCount": "Nombre de règles de filtre :",
            "resetDefaultFilters": "Réinstaller les filtres par défaut",
            "filtersCount_zero": "{{count}} règle de filtre au total",
            "filtersCount_one": "{{count}} règle de filtre au total",
            "filtersCount_other": "{{count}} règles de filtre au total",
            "filtersStorageSize": "{{count}} {{unit}} de stockage utilisé",
            "filtersStorageMaxSize": "{{count}} {{unit}} au maximum",
            "filtersWithErrorCount_zero": "{{count}} règle de filtre en erreur",
            "filtersWithErrorCount_one": "{{count}} règle de filtre en erreur",
            "filtersWithErrorCount_other": "{{count}} règles de filtre en erreur",
            "seeErrorDetails": "Voir le détail des erreurs",
            "filterErrorsLabel": "Erreurs du filtre",
            "errorType": {
                "no_type": "Aucune règle de filtre renseignée",
                "no_filter": "Aucun paramètre (sélecteur CSS) renseigné pour le filtre",
                "wrong_css_selector": "Sélecteur CSS incorrect",
                "unknown_type": "Règle de filtre inconnue",
                "incorrect_regexp": "Expression régulière de sélection du site web/page web incorrecte",
                "empty": "Ligne vide",
                "unknown": "Erreur inconnue"
            },
            "errorLine": "Erreur trouvée à la ligne n°{{count}}",
            "errorLineDetails": "Partie de la règle incriminée :",
            "errorLineMessage": "Message d'erreur complet :",
            "errorCount":  "Nombre de règles de filtre en erreur :",
            "customFilterEditErrorDetected": "Des erreurs ont été détectées dans votre filtre",
            "errorCode": "Code de l'erreur :",
            "hasUpdate": "Une mise à jour est disponible pour ce filtre",
            "hasUpdateAuto": "La mise à jour s'effectuera automatiquement, mais vous pouvez l'effectuer manuellement"
        },
        "autoDisableDarkThemedWebsiteSettings": {
            "title": "Paramètres de la désactivation automatique de Page Shadow sur les sites/pages ayant un thème sombre",
            "typeLabel": "Désactiver automatiquement pour :",
            "website": "L'ensemble du site web détecté",
            "webpage": "Uniquement pour la page web détectée"
        },
        "close": "Fermer",
        "ok": "OK",
        "yes": "Oui",
        "no": "Non",
        "confirm": "Valider",
        "save": "Sauvegarder",
        "load": "Charger",
        "create": "Créer",
        "delete": "Supprimer",
        "cancel": "Annuler",
        "closeAndSave": "Fermer et sauvegarder",
        "closeWithoutSave": "Fermer sans sauvegarder",
        "edit": "Éditer"
    },
    "unit": {
        "gigabyte": "Go",
        "megabyte": "Mo",
        "kilobyte": "Ko",
        "byte": "o"
    }
}
