{
    "nav": {
        "toggleNavigation": "Baculer vers la navigation",
        "advancedSettings": "Paramètres avancés",
        "testPage": "Page de test",
        "actual": "(actuel)"
    },
    "container": {
        "description": "Ici, vous pouvez définir certains paramètres avancés ou consulter les informations sur l'extension. N'oubliez pas de cliquer sur Valider pour sauvegarder vos paramètres !",
        "about": "À propos de Page Shadow",
        "update": "Rechercher une mise à jour",
        "labelLanguage": "Langue :",
            "language": {
                "fr": "Français",
                "en": "English"
            },
        "labelList": "Liste des sites/pages à exclure (un élément par ligne) :",
        "titleHelp": "Il est seulement possible de bloquer des domaines (par ex. www.google.fr) ou des URLs particulières (par ex. https://fr.wikipedia.org/wiki/Google). Notez que vous pouvez exclure un site ou une page à l'aide du clic-droit et en choissant quoi bloquer dans le sous-menu Page Shadow, ou à l'aide du menu de l'extension (tout en bas).",
        "help": "Aide",
        "customThemeButton": "Paramétrer votre thème personnalisé…",
        "indiceList": "Les adresses des sites entrées ci-dessous seront ignorées par Page Shadow.",
        "whiteList": "Liste blanche (ignorer par défaut tous les sites)",
        "titleWhiteList": "Cochez cette case si vous souhaitez basculer cette liste en liste blanche. Tous les sites seront par défaut exclus, et vous devrez les débloquer à l'aide du clic-droit, à l'aide du menu de l'extension ou en entrant leurs adresses ci-dessous (par ex. www.google.fr). Le bloquage/débloquage d'URLs particulières n'est pas possible dans ce mode. Activer ou désactiver ce paramètre réinitialisera la liste.",
        "textareaPlaceholder": "Exemple :\nwww.google.fr\nhttps://fr.wikipedia.org/wiki/Google",
        "reset": "Réinitialiser les paramètres",
        "validate": "Valider"
    },
    "modal": {
        "about": {
            "title": "À propos de Page Shadow",
            "description": "Page Shadow est disponible sur Firefox, Chrome, Opera et Microsoft Edge. Cette extension est conçue par Eliastik",
            "readme": "Fichier Lisez-moi",
            "homepage": "Page officielle",
            "contact": {
                "title": "Contacter le développeur",
                "email": "Par e-mail",
                "github": "Via Github (issues)"
            },
            "webpage": "Page web de Page Shadow :",
            "version": "Version actuelle :",
            "browser": "Votre navigateur web :",
            "changelogTitle": "Journal des changements :",
                "changelog": {
                    "22": "<ul><li>Ajout de 5 nouveaux thèmes (10 à 15) ;</li><li>Corrections de bugs, changements importants dans la structure de l'extension et ajustements mineurs, notamment : <ul><li>Optimisations et changements importants dans le code de la gestion des paramètres (détection dynamique des changements en temps réel) ;</li><li>Corrections de bugs pour Firefox pour Android : la désactivation  de l'extension pour un site ou une page fonctionne désormais, le panneau des paramètres principal défile désormais correctement ;</li><li>Correction d'un bug de l'outil Baisser la luminosité de la page : dans certains cas, le pourcentage de baisse de la luminosité pouvait être incorrect, ce rendait le panneau des paramètres entièrement sombre ;</li></ul></li><li>Pour le reste des changements, voir le fichier Lisez-moi.</li></ul>",
                    "211": "<ul><li>Erreur de parsing XML avec Firefox corrigé (bug avec i18nextXHRBackend) ;</li><li>Les paramètres sont désormais initialisés dès l'installation de l'extension ;</li><li>Bug corrigé avec le fichier manifeste pour Microsoft Edge (clé persistent dans la clé background).</li></ul>",
                    "21": "<ul><li>Amélioration des performances par la correction d'un bug : le processeur pouvait être occupé à plus de 50% dans certains cas particuliers ;</li><li>Ajout de la possibilité de basculer la liste des sites à ignorer en liste blanche : tous les sites sont dans ce cas ignorés, et il faut les débloquer manuellement ;</li><li>Ajout de la possibilité de choisir la température de couleur utilisée par le Mode nuit ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                    "203": "<ul><li>Il est désormais possible de désactiver Page Shadow pour un site ou une page particulière via le clic-droit ou via le menu de l'extension ;</li><li>Corrections de bugs et ajustements mineurs (voir le fichier Lisez-moi).</li></ul>",
                    "202": "<ul><li>Les paramètres peuvent désormais être appliqués en temps réel ;</li><li>Correction de l'icône de Page Shadow (l'ombre est de meilleure qualité) ;</li><li>Corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                    "201": "<ul><li>Compatibilité Microsoft Edge ;</li><li>Amélioration des performances et corrections de bugs (voir le fichier Lisez-moi).</li></ul>",
                    "2": "<ul><li>Compatibilité Firefox ;</li><li>Nouveau thème graphique basé sur Bootstrap ;</li><li>Moteur de traduction intégré et ajout d'une traduction en anglais ;</li><li>Ajout de thèmes de couleur pour l'outil \"Augmenter le contraste\" ;</li><li>Ajout d'un mode nuit ;</li><li>Ajout d'un mode permettant d'inverser la couleur des images ;</li><li>Amélioration des performances ;</li><li>Corrections diverses (bugs, textes).</li></ul>",
                    "121": "<ul><li>Correction d'un bug dans les paramètres avancés ;</li><li>Ajout d'informations sur l'application dans les paramètres avancés.</li></ul>",
                    "12": "<ul><li>Optimisation de la mise en page de la popup ;</li><li>Amélioration de l'outil \"Augmenter le contraste\". Les images transparentes sont désormais prises en charge ;</li><li>Quelques ajustements.</li></ul>",
                    "11": "<ul><li>Amélioration de la fonction \"Augmenter le contraste\".</li></ul>",
                    "1": "<ul><li>Version initiale.</li></ul>",
                        "versionNames": {
                            "22": "Version 2.2 (25/10/2017)",
                            "211": "Version 2.1.1 (09/09/2017)",
                            "21": "Version 2.1 (04/09/2017)",
                            "203": "Version 2.0.3 (09/07/2017)",
                            "202": "Version 2.0.2 (17/06/2017)",
                            "201": "Version 2.0.1 (09/06/2017)",
                            "2": "Version 2.0 (05/06/2017)",
                            "12": "Version 1.2",
                            "11": "Version 1.1",
                            "1": "Version 1.0"
                        }
                }
        },
        "readme": {
            "title": "Fichier Lisez-moi",
            "src": "README_FR.txt"
        },
        "customTheme": {
            "title": "Paramètres du thème personnalisé",
            "description": "Ici, vous pouvez paramétrer votre thème personnalisé. Pour modifier les couleurs du thème, cliquez sur les cercles colorés et choisissez une couleur. Pour valider vos paramètres, fermez cette fenêtre et cliquez sur le bouton « Valider » présent en bas de cette page.",
            "background": "Couleur de fond :",
            "texts": "Couleur des textes :",
            "links": "Couleur des liens :",
            "preview": "Prévisualisation :",
            "previewText": "Un texte.",
            "previewLink": "Un lien."
        },
        "saved": {
            "title": "Information",
            "message": "Paramètres sauvegardés !"
        },
        "reset": {
            "title": "Information",
            "message": "Tous les paramètres ont été réinitialisés !"
        },
        "resetConfirm": {
            "title": "Confirmation",
            "message": "Êtes-vous sûr de vouloir réinitialiser tous les paramètres de l'extension ?"
        },
        "close": "Fermer",
        "ok": "OK",
        "yes": "Oui",
        "no": "Non",
        "confirm": "Valider"
    }
}
